[
  {
    "id": 1,
    "title": "Qual é a principal vantagem do modelo de computação em nuvem em relação à infraestrutura tradicional on-premises?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Necessidade de manter equipe dedicada para gerenciar hardware físico.",
        "because": "Incorreto: A nuvem justamente elimina essa necessidade, não a cria. A resposta correta é 'Trocar CapEx por OpEx variáveis', que representa o benefício financeiro fundamental da nuvem versus on-premises.",
        "rep": false
      },
      {
        "alternative": "Trocar despesas de capital (CapEx) por despesas operacionais (OpEx) variáveis.",
        "because": "Correto: Na nuvem, você não precisa investir antecipadamente em datacenters e servidores. Você paga apenas pelo que usa (OpEx), convertendo custos fixos em variáveis e eliminando a necessidade de prever capacidade futura.",
        "rep": true
      },
      {
        "alternative": "Custos sempre mais baixos independente do padrão de uso.",
        "because": "Incorreto: Os custos dependem do padrão de uso; em alguns casos on-premises pode ser mais econômico. A resposta correta é 'Trocar CapEx por OpEx variáveis', que é o benefício econômico real: flexibilidade financeira e eliminação de investimento inicial.",
        "rep": false
      },
      {
        "alternative": "Garantir controle físico total sobre todos os servidores e hardware.",
        "because": "Incorreto: Na nuvem você não tem controle físico do hardware, isso é responsabilidade do provedor. A resposta correta é 'Trocar CapEx por OpEx variáveis', pois o benefício principal é a mudança no modelo financeiro e eliminação de investimentos iniciais.",
        "rep": false
      }
    ]
  },
  {
    "id": 2,
    "title": "O que significa elasticidade na computação em nuvem AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Pagar valor fixo mensal independente do uso dos recursos.",
        "because": "Incorreto: Isso se refere ao modelo de precificação, não à elasticidade. A resposta correta é 'Aumentar ou diminuir recursos conforme demanda', que define a capacidade de ajustar recursos de forma dinâmica.",
        "rep": false
      },
      {
        "alternative": "Armazenar dados em múltiplas regiões geográficas automaticamente.",
        "because": "Incorreto: Isso descreve replicação geográfica ou alta disponibilidade. A resposta correta é 'Aumentar ou diminuir recursos conforme demanda', que é a definição específica de elasticidade.",
        "rep": false
      },
      {
        "alternative": "Manter sempre o mesmo número de recursos independente da carga.",
        "because": "Incorreto: Isso é capacidade estática, o oposto de elasticidade. A resposta correta é 'Aumentar ou diminuir recursos conforme demanda', pois elasticidade significa adaptar recursos dinamicamente às necessidades em tempo real.",
        "rep": false
      },
      {
        "alternative": "Capacidade de aumentar ou diminuir recursos automaticamente conforme a demanda.",
        "because": "Correto: Elasticidade permite que sua infraestrutura cresça durante picos de demanda e diminua em períodos de baixo uso, automaticamente ou sob demanda, otimizando custos e performance sem intervenção manual.",
        "rep": true
      }
    ]
  },
  {
    "id": 3,
    "title": "Qual dos seguintes é um benefício da alta disponibilidade na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Reduzir custos eliminando redundância de recursos.",
        "because": "Incorreto: Alta disponibilidade geralmente requer redundância, o que pode aumentar custos. A resposta correta é 'Minimizar downtime distribuindo em múltiplas AZs', sendo o benefício a resiliência, não redução de custos.",
        "rep": false
      },
      {
        "alternative": "Minimizar downtime distribuindo recursos em múltiplas Zonas de Disponibilidade.",
        "because": "Correto: Alta disponibilidade na AWS é alcançada distribuindo aplicações em múltiplas AZs (Availability Zones) dentro de uma região, garantindo que a falha de uma zona não afete toda a aplicação, reduzindo tempo de inatividade.",
        "rep": true
      },
      {
        "alternative": "Concentrar todos os recursos em uma única zona para melhor performance.",
        "because": "Incorreto: Concentrar em uma zona cria ponto único de falha. A resposta correta é 'Minimizar downtime distribuindo em múltiplas AZs', pois alta disponibilidade requer redundância geográfica.",
        "rep": false
      },
      {
        "alternative": "Eliminar completamente a necessidade de backups de dados.",
        "because": "Incorreto: Alta disponibilidade não substitui backups, que protegem contra corrupção de dados e erros humanos. A resposta correta é 'Minimizar downtime distribuindo em múltiplas AZs', pois alta disponibilidade trata de continuidade operacional.",
        "rep": false
      }
    ]
  },
  {
    "id": 4,
    "title": "Qual é a diferença entre uma Região AWS e uma Zona de Disponibilidade (AZ)?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Regiões são apenas para backup; AZs são para operação principal.",
        "because": "Incorreto: Ambas são usadas para operações; AZs dentro de Regiões fornecem alta disponibilidade. A resposta correta é 'Região com múltiplas AZs; AZ é datacenter isolado', definindo corretamente a relação hierárquica.",
        "rep": false
      },
      {
        "alternative": "AZ é maior que Região e contém múltiplas regiões dentro dela.",
        "because": "Incorreto: A hierarquia está invertida. A resposta correta é 'Região contém múltiplas AZs; AZ é datacenter isolado', pois Regiões são o nível mais alto da hierarquia geográfica.",
        "rep": false
      },
      {
        "alternative": "Região e AZ são termos sinônimos que significam a mesma coisa.",
        "because": "Incorreto: São conceitos diferentes em níveis geográficos distintos. A resposta correta é 'Região é localização geográfica com múltiplas AZs; AZ é datacenter isolado', pois Região é o container e AZ é o componente dentro dela.",
        "rep": false
      },
      {
        "alternative": "Região é localização geográfica com múltiplas AZs; AZ é datacenter isolado dentro de uma Região.",
        "because": "Correto: Uma Região AWS (ex: us-east-1) é uma área geográfica que contém múltiplas Zonas de Disponibilidade (tipicamente 3 ou mais). Cada AZ consiste em um ou mais datacenters fisicamente separados com energia, rede e conectividade redundantes.",
        "rep": true
      }
    ]
  },
  {
    "id": 5,
    "title": "O que caracteriza o modelo IaaS (Infrastructure as a Service)?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Fornece aplicações completas prontas para uso sem necessidade de gerenciamento.",
        "because": "Incorreto: Isso descreve SaaS (Software as a Service). A resposta correta é 'Fornece infraestrutura virtualizada sob demanda', pois IaaS requer que você gerencie SO e aplicações.",
        "rep": false
      },
      {
        "alternative": "Fornece plataforma gerenciada para desenvolvimento sem acesso à infraestrutura.",
        "because": "Incorreto: Isso descreve PaaS (Platform as a Service). A resposta correta é 'Fornece infraestrutura virtualizada', pois IaaS dá mais controle e acesso à camada de infraestrutura.",
        "rep": false
      },
      {
        "alternative": "Fornece infraestrutura de TI virtualizada (servidores, armazenamento, rede) sob demanda.",
        "because": "Correto: IaaS fornece recursos fundamentais de computação onde você gerencia o sistema operacional, aplicações e dados, enquanto o provedor gerencia virtualização, servidores, armazenamento e rede. Amazon EC2 é exemplo de IaaS.",
        "rep": true
      },
      {
        "alternative": "O provedor gerencia completamente SO, aplicações e dados do cliente.",
        "because": "Incorreto: No IaaS, o cliente gerencia SO, aplicações e dados. A resposta correta é 'Fornece infraestrutura virtualizada', onde você tem responsabilidade sobre as camadas superiores.",
        "rep": false
      }
    ]
  },
  {
    "id": 6,
    "title": "Qual conceito descreve 'agilidade' como benefício da nuvem AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Garantir que recursos nunca falhem ou tenham downtime.",
        "because": "Incorreto: Isso descreve alta disponibilidade ou confiabilidade. A resposta correta é 'Reduzir tempo de provisionamento', pois agilidade trata de velocidade de acesso a recursos, não de disponibilidade.",
        "rep": false
      },
      {
        "alternative": "Pagar apenas pelos recursos que você realmente utiliza.",
        "because": "Incorreto: Isso descreve o modelo pay-as-you-go ou benefício econômico. A resposta correta é 'Reduzir tempo de provisionamento', pois agilidade é sobre rapidez no acesso a tecnologia.",
        "rep": false
      },
      {
        "alternative": "Reduzir tempo de provisionamento de recursos de semanas para minutos.",
        "because": "Correto: Agilidade na nuvem significa acesso rápido a recursos de TI sob demanda. O que antes levava semanas (comprar, instalar hardware) agora leva minutos (lançar instância EC2), acelerando experimentação e inovação.",
        "rep": true
      },
      {
        "alternative": "Executar aplicações sempre na região mais próxima do usuário final.",
        "because": "Incorreto: Isso descreve alcance global ou latência reduzida. A resposta correta é 'Reduzir tempo de provisionamento para minutos', pois agilidade refere-se à velocidade de obter recursos.",
        "rep": false
      }
    ]
  },
  {
    "id": 7,
    "title": "O que significa 'alcance global' (global reach) na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Obrigatoriedade de usar todas as regiões AWS para cada aplicação.",
        "because": "Incorreto: Você escolhe quais regiões usar baseado em necessidades. A resposta correta é 'Capacidade de implantar em múltiplas regiões', pois é uma opção, não obrigação.",
        "rep": false
      },
      {
        "alternative": "Capacidade de implantar aplicações em múltiplas regiões geográficas ao redor do mundo.",
        "because": "Correto: AWS possui infraestrutura global com regiões em todos os continentes, permitindo implantar aplicações próximas aos usuários finais, reduzindo latência e atendendo requisitos de residência de dados em minutos.",
        "rep": true
      },
      {
        "alternative": "AWS replica automaticamente todos os dados em todas as regiões.",
        "because": "Incorreto: Replicação entre regiões deve ser configurada explicitamente. A resposta correta é 'Capacidade de implantar em múltiplas regiões', que é o conceito de alcance global.",
        "rep": false
      },
      {
        "alternative": "Todos os serviços AWS estão disponíveis em todas as regiões igualmente.",
        "because": "Incorreto: Alguns serviços têm disponibilidade regional limitada. A resposta correta é 'Implantar aplicações em múltiplas regiões', pois alcance global refere-se à presença geográfica da AWS.",
        "rep": false
      }
    ]
  },
  {
    "id": 8,
    "title": "Qual é a principal característica do modelo de responsabilidade compartilhada da AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Cliente é responsável pela segurança física dos datacenters AWS.",
        "because": "Incorreto: Segurança física é responsabilidade da AWS. A resposta correta é 'AWS pela segurança DA nuvem; cliente NA nuvem', onde segurança física está incluída na responsabilidade da AWS.",
        "rep": false
      },
      {
        "alternative": "AWS é responsável pela segurança 'da' nuvem; cliente pela segurança 'na' nuvem.",
        "because": "Correto: AWS gerencia segurança da infraestrutura física, rede e virtualização (segurança DA nuvem). Cliente gerencia dados, aplicações, configurações, IAM e criptografia (segurança NA nuvem). A responsabilidade varia conforme o serviço (IaaS vs PaaS vs SaaS).",
        "rep": true
      },
      {
        "alternative": "AWS é responsável por toda a segurança, incluindo dados do cliente.",
        "because": "Incorreto: Cliente sempre é responsável pelos próprios dados. A resposta correta é 'AWS pela segurança DA nuvem; cliente NA nuvem', pois há divisão clara de responsabilidades.",
        "rep": false
      },
      {
        "alternative": "Modelo onde ambas as partes podem ignorar aspectos de segurança.",
        "because": "Incorreto: Modelo define responsabilidades claras que ambos devem cumprir. A resposta correta é 'AWS pela segurança DA nuvem; cliente NA nuvem', estabelecendo obrigações específicas para cada parte.",
        "rep": false
      }
    ]
  },
  {
    "id": 9,
    "title": "Quando você deve considerar usar computação serverless na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Para aplicações legadas que não podem ser modificadas.",
        "because": "Incorreto: Aplicações legadas geralmente requerem VMs tradicionais. A resposta correta é 'Executar código orientado a eventos', pois serverless requer arquitetura específica event-driven.",
        "rep": false
      },
      {
        "alternative": "Quando você precisa de controle total sobre sistema operacional e configurações de rede.",
        "because": "Incorreto: Serverless abstrai infraestrutura e SO. A resposta correta é 'Executar código orientado a eventos sem gerenciar servidores', pois serverless elimina acesso direto à infraestrutura.",
        "rep": false
      },
      {
        "alternative": "Para executar código orientado a eventos sem gerenciar servidores.",
        "because": "Correto: Serverless (como AWS Lambda) é ideal para código que responde a eventos (uploads S3, requisições API, mensagens), execuções curtas e intermitentes, onde você não quer gerenciar infraestrutura e paga apenas pelo tempo de execução.",
        "rep": true
      },
      {
        "alternative": "Para aplicações que precisam executar continuamente 24/7 com requisitos específicos de hardware.",
        "because": "Incorreto: Para workloads contínuos, EC2 pode ser mais econômico. A resposta correta é 'Executar código orientado a eventos', pois serverless é otimizado para cargas intermitentes e event-driven.",
        "rep": false
      }
    ]
  },
  {
    "id": 10,
    "title": "O que são edge locations na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Locais físicos acessíveis apenas para clientes Enterprise.",
        "because": "Incorreto: Edge locations são usadas automaticamente por CloudFront para todos. A resposta correta é 'Locais que armazenam cache próximo aos usuários', disponíveis para qualquer cliente usando CDN.",
        "rep": false
      },
      {
        "alternative": "Sinônimo de Regiões AWS onde você pode lançar instâncias EC2.",
        "because": "Incorreto: Edge locations são separadas de Regiões e não hospedam EC2. A resposta correta é 'Locais que armazenam cache próximo aos usuários', pois edge locations são específicas para CDN e cache.",
        "rep": false
      },
      {
        "alternative": "Datacenters onde você pode armazenar backups de longo prazo.",
        "because": "Incorreto: Backups são armazenados em Regiões (S3, Glacier). A resposta correta é 'Locais que armazenam cache de conteúdo', pois edge locations são para distribuição rápida, não armazenamento durável.",
        "rep": false
      },
      {
        "alternative": "Locais que armazenam cópias em cache de conteúdo mais próximo aos usuários finais.",
        "because": "Correto: Edge locations fazem parte da rede de entrega de conteúdo (CDN) do Amazon CloudFront. São datacenters que armazenam cache de conteúdo popular próximo aos usuários, reduzindo latência. Há mais edge locations que Regiões AWS.",
        "rep": true
      }
    ]
  },
  {
    "id": 11,
    "title": "Qual princípio de segurança da AWS recomenda conceder apenas permissões necessárias?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Princípio de acesso total por padrão.",
        "because": "Incorreto: Acesso total por padrão viola princípios de segurança. A resposta correta é 'Princípio do menor privilégio', que limita acesso ao mínimo necessário para reduzir riscos.",
        "rep": false
      },
      {
        "alternative": "Princípio do menor privilégio (Least Privilege).",
        "because": "Correto: O princípio do menor privilégio significa conceder aos usuários e serviços apenas as permissões mínimas necessárias para executar suas tarefas. Isso reduz o risco de ações acidentais ou maliciosas e limita o impacto de credenciais comprometidas.",
        "rep": true
      },
      {
        "alternative": "Princípio de compartilhamento de credenciais entre equipes.",
        "because": "Incorreto: Compartilhar credenciais é má prática de segurança. A resposta correta é 'Princípio do menor privilégio', que enfatiza permissões mínimas individuais, não compartilhamento.",
        "rep": false
      },
      {
        "alternative": "Princípio de ignorar auditoria para facilitar operações.",
        "because": "Incorreto: Auditoria é essencial para segurança. A resposta correta é 'Princípio do menor privilégio', que trata de limitar permissões, não de eliminar controles de auditoria.",
        "rep": false
      }
    ]
  },
  {
    "id": 12,
    "title": "O que é AWS IAM (Identity and Access Management)?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Sistema de monitoramento de performance de aplicações.",
        "because": "Incorreto: Monitoramento é função do CloudWatch. A resposta correta é 'Gerenciar usuários e controlar acesso', pois IAM foca em autenticação e autorização.",
        "rep": false
      },
      {
        "alternative": "Serviço para armazenar backups criptografados de dados.",
        "because": "Incorreto: Backup é função de S3/Glacier com criptografia. A resposta correta é 'Gerenciar usuários e controlar acesso', pois IAM trata de identidade e permissões, não armazenamento.",
        "rep": false
      },
      {
        "alternative": "Ferramenta de criação de relatórios de custos e billing.",
        "because": "Incorreto: Relatórios de custo são do Cost Explorer. A resposta correta é 'Gerenciar usuários e controlar acesso', pois IAM gerencia identidades e permissões.",
        "rep": false
      },
      {
        "alternative": "Serviço para gerenciar usuários e controlar acesso aos recursos AWS de forma segura.",
        "because": "Correto: IAM permite criar e gerenciar usuários, grupos, roles e policies para controlar quem pode acessar quais recursos AWS. É fundamental para implementar princípio do menor privilégio e autenticação/autorização. IAM é um serviço global e gratuito.",
        "rep": true
      }
    ]
  },
  {
    "id": 13,
    "title": "Por que habilitar autenticação multifator (MFA) é uma boa prática na AWS?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Permite que múltiplos usuários compartilhem a mesma conta com segurança.",
        "because": "Incorreto: Compartilhar contas é má prática mesmo com MFA. A resposta correta é 'Adiciona camada extra de proteção', pois MFA protege contas individuais, não autoriza compartilhamento.",
        "rep": false
      },
      {
        "alternative": "Adiciona camada extra de proteção exigindo senha e token/código adicional.",
        "because": "Correto: MFA protege contra acesso não autorizado mesmo se a senha for comprometida, exigindo segundo fator (token físico, app autenticador ou SMS). É especialmente importante para usuário root e usuários com privilégios administrativos.",
        "rep": true
      },
      {
        "alternative": "Elimina necessidade de políticas de IAM e permissões.",
        "because": "Incorreto: MFA trata de autenticação; políticas IAM tratam de autorização. A resposta correta é 'Adiciona camada extra de proteção', pois MFA é controle de autenticação adicional.",
        "rep": false
      },
      {
        "alternative": "Substitui completamente a necessidade de usar senhas fortes.",
        "because": "Incorreto: MFA complementa senhas fortes, não as substitui. A resposta correta é 'Adiciona camada extra de proteção', pois MFA funciona em conjunto com senha, formando autenticação de dois fatores.",
        "rep": false
      }
    ]
  },
  {
    "id": 14,
    "title": "Qual serviço AWS ajuda a proteger aplicações web contra ataques comuns como SQL injection?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon VPC.",
        "because": "Incorreto: VPC fornece isolamento de rede, mas não proteção de aplicação web. A resposta correta é 'AWS WAF', que opera na camada 7 (aplicação) especificamente para proteger contra ataques web.",
        "rep": false
      },
      {
        "alternative": "AWS WAF (Web Application Firewall).",
        "because": "Correto: AWS WAF protege aplicações web filtrando tráfego HTTP/HTTPS malicioso. Permite criar regras para bloquear padrões de ataque comuns como SQL injection, cross-site scripting (XSS) e pode integrar com CloudFront, ALB e API Gateway.",
        "rep": true
      },
      {
        "alternative": "Amazon S3.",
        "because": "Incorreto: S3 é serviço de armazenamento de objetos. A resposta correta é 'AWS WAF', pois WAF é especificamente projetado para proteger aplicações web contra ataques na camada de aplicação.",
        "rep": false
      },
      {
        "alternative": "AWS IAM.",
        "because": "Incorreto: IAM gerencia identidades e acessos, não filtra tráfego web. A resposta correta é 'AWS WAF', que inspeciona requisições HTTP para detectar e bloquear ataques web.",
        "rep": false
      }
    ]
  },
  {
    "id": 15,
    "title": "Qual serviço AWS permite centralizar e automatizar conformidade de configurações de recursos?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "AWS Lambda.",
        "because": "Incorreto: Lambda executa código serverless, não audita configurações. A resposta correta é 'AWS Config', serviço específico para governança e conformidade de configurações.",
        "rep": false
      },
      {
        "alternative": "Amazon Inspector.",
        "because": "Incorreto: Inspector avalia vulnerabilidades de segurança em aplicações, não configurações. A resposta correta é 'AWS Config', que fornece inventário de configurações e avaliação de conformidade.",
        "rep": false
      },
      {
        "alternative": "Amazon CloudWatch.",
        "because": "Incorreto: CloudWatch monitora performance e métricas, não conformidade de configurações. A resposta correta é 'AWS Config', que rastreia e avalia configurações contra regras de conformidade.",
        "rep": false
      },
      {
        "alternative": "AWS Config.",
        "because": "Correto: AWS Config avalia, audita e monitora configurações de recursos AWS continuamente. Permite verificar conformidade com padrões internos, rastrear mudanças de configuração ao longo do tempo e receber alertas quando recursos ficam fora de conformidade.",
        "rep": true
      }
    ]
  },
  {
    "id": 16,
    "title": "O que significa criptografia 'em repouso' (at rest)?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Criptografar dados armazenados em discos, databases ou outros sistemas de armazenamento.",
        "because": "Correto: Criptografia em repouso protege dados quando armazenados (não sendo transmitidos), como em volumes EBS, buckets S3, bancos RDS. Impede acesso não autorizado mesmo se alguém obtiver acesso físico aos discos.",
        "rep": true
      },
      {
        "alternative": "Criptografar apenas metadados, não o conteúdo real.",
        "because": "Incorreto: Criptografia em repouso protege o conteúdo completo. A resposta correta é 'Criptografar dados armazenados', incluindo todo o conteúdo, não apenas metadados.",
        "rep": false
      },
      {
        "alternative": "Criptografar dados durante transmissão pela rede.",
        "because": "Incorreto: Isso é criptografia em trânsito (in transit). A resposta correta é 'Criptografar dados armazenados', pois 'em repouso' refere-se a dados não em movimento.",
        "rep": false
      },
      {
        "alternative": "Substituir controles de acesso e permissões IAM.",
        "because": "Incorreto: Criptografia complementa controles de acesso, não os substitui. A resposta correta é 'Criptografar dados armazenados', sendo uma camada adicional de segurança.",
        "rep": false
      }
    ]
  },
  {
    "id": 17,
    "title": "Qual serviço AWS fornece relatórios de conformidade como SOC, PCI e ISO?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "AWS Systems Manager.",
        "because": "Incorreto: Systems Manager gerencia e automatiza tarefas operacionais. A resposta correta é 'AWS Artifact', serviço específico para documentos de conformidade.",
        "rep": false
      },
      {
        "alternative": "AWS CloudTrail.",
        "because": "Incorreto: CloudTrail registra chamadas de API, não fornece relatórios de conformidade. A resposta correta é 'AWS Artifact', repositório central de documentos de conformidade e certificações.",
        "rep": false
      },
      {
        "alternative": "AWS Artifact.",
        "because": "Correto: AWS Artifact é portal de autoatendimento para acessar relatórios de conformidade e certificações da AWS (SOC 1/2/3, PCI DSS, ISO 27001, etc.) e acordos como BAA. Disponível sob demanda sem custo adicional.",
        "rep": true
      },
      {
        "alternative": "Amazon Inspector.",
        "because": "Incorreto: Inspector avalia vulnerabilidades de aplicações. A resposta correta é 'AWS Artifact', que fornece acesso a relatórios de auditoria e certificações da AWS.",
        "rep": false
      }
    ]
  },
  {
    "id": 18,
    "title": "Para que serve o AWS CloudTrail?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Distribuir conteúdo globalmente via CDN.",
        "because": "Incorreto: CDN é função do CloudFront. A resposta correta é 'Registrar ações de API', pois CloudTrail cria trilha de auditoria de atividades na conta.",
        "rep": false
      },
      {
        "alternative": "Executar backups automáticos de instâncias EC2.",
        "because": "Incorreto: Backups são feitos com snapshots EBS ou AWS Backup. A resposta correta é 'Registrar ações de API', pois CloudTrail é para auditoria e governança, não backup.",
        "rep": false
      },
      {
        "alternative": "Registrar e monitorar todas as ações de API realizadas na conta AWS.",
        "because": "Correto: CloudTrail fornece histórico de eventos da conta AWS, registrando quem fez o quê, quando e de onde. Essencial para auditoria de segurança, análise de conformidade, troubleshooting operacional e análise forense de incidentes.",
        "rep": true
      },
      {
        "alternative": "Bloquear automaticamente usuários suspeitos.",
        "because": "Incorreto: CloudTrail registra eventos, não bloqueia acesso. A resposta correta é 'Registrar ações de API', sendo ferramenta de logging e auditoria, não de prevenção.",
        "rep": false
      }
    ]
  },
  {
    "id": 19,
    "title": "Qual recurso AWS ajuda a proteger a conta root?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": true,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Usar a conta root para tarefas diárias de administração.",
        "because": "Incorreto: Deve-se evitar usar conta root rotineiramente. A resposta correta é 'Habilitar MFA na conta root', pois conta root deve ser usada raramente e protegida com MFA.",
        "rep": false
      },
      {
        "alternative": "Habilitar MFA (autenticação multifator) na conta root.",
        "because": "Correto: MFA na conta root adiciona camada crítica de segurança. Como a conta root tem acesso irrestrito a todos os recursos, protegê-la com MFA é uma das melhores práticas mais importantes da AWS.",
        "rep": true
      },
      {
        "alternative": "Criar usuários IAM com privilégios apropriados para tarefas administrativas.",
        "because": "Correto: Em vez de usar conta root, crie usuários IAM com permissões necessárias para tarefas administrativas diárias, mantendo a conta root para uso extremamente limitado (mudança de plano de suporte, fechamento de conta).",
        "rep": true
      },
      {
        "alternative": "Compartilhar credenciais da conta root com toda a equipe.",
        "because": "Incorreto: Nunca compartilhe credenciais root. A resposta correta é 'Habilitar MFA na conta root' e criar usuários IAM individuais para a equipe.",
        "rep": false
      }
    ]
  },
  {
    "id": 20,
    "title": "O que é AWS Shield?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de proteção gerenciada contra ataques DDoS (Distributed Denial of Service).",
        "because": "Correto: AWS Shield protege aplicações contra ataques DDoS. Shield Standard é gratuito e automático para todos os clientes. Shield Advanced oferece proteção adicional, detecção avançada e equipe de resposta a DDoS 24/7.",
        "rep": true
      },
      {
        "alternative": "Sistema de detecção de intrusão em instâncias EC2.",
        "because": "Incorreto: Detecção de intrusão em instâncias seria GuardDuty ou Inspector. A resposta correta é 'Proteção contra DDoS', pois Shield opera na camada de rede/transporte.",
        "rep": false
      },
      {
        "alternative": "Serviço de backup e recuperação de desastres.",
        "because": "Incorreto: Backup é função de S3/Glacier e AWS Backup. A resposta correta é 'Proteção contra DDoS', pois Shield protege disponibilidade contra ataques volumétricos.",
        "rep": false
      },
      {
        "alternative": "Firewall de aplicação web para bloquear SQL injection.",
        "because": "Incorreto: Isso é função do AWS WAF. A resposta correta é 'Proteção contra ataques DDoS', pois Shield foca especificamente em mitigar ataques de negação de serviço distribuídos.",
        "rep": false
      }
    ]
  },
  {
    "id": 21,
    "title": "Qual serviço AWS você usaria para executar máquinas virtuais na nuvem?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "AWS Lambda.",
        "because": "Incorreto: Lambda é serverless, você não gerencia VMs. A resposta correta é 'Amazon EC2', que fornece máquinas virtuais onde você tem controle sobre SO e configurações.",
        "rep": false
      },
      {
        "alternative": "Amazon RDS.",
        "because": "Incorreto: RDS é serviço gerenciado de banco de dados. A resposta correta é 'Amazon EC2', serviço específico para provisionamento de máquinas virtuais.",
        "rep": false
      },
      {
        "alternative": "Amazon EC2 (Elastic Compute Cloud).",
        "because": "Correto: EC2 fornece capacidade de computação redimensionável através de servidores virtuais (instâncias) na nuvem. Você escolhe tipo de instância, sistema operacional, armazenamento e configurações de rede, tendo controle total sobre a VM.",
        "rep": true
      },
      {
        "alternative": "Amazon S3.",
        "because": "Incorreto: S3 é para armazenamento de objetos, não execução de VMs. A resposta correta é 'Amazon EC2', pois EC2 é o serviço de computação virtualizada da AWS.",
        "rep": false
      }
    ]
  },
  {
    "id": 22,
    "title": "Qual serviço AWS é recomendado para armazenar arquivos estáticos de um website?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Amazon RDS.",
        "because": "Incorreto: RDS é para bancos de dados relacionais, não arquivos estáticos. A resposta correta é 'Amazon S3', serviço de object storage ideal para conteúdo estático.",
        "rep": false
      },
      {
        "alternative": "AWS Lambda.",
        "because": "Incorreto: Lambda executa código, não armazena arquivos estáticos. A resposta correta é 'Amazon S3', que fornece armazenamento durável e escalável para objetos.",
        "rep": false
      },
      {
        "alternative": "Amazon EC2.",
        "because": "Incorreto: EC2 pode servir arquivos, mas S3 é mais econômico e apropriado para estáticos. A resposta correta é 'Amazon S3', otimizado para armazenamento e entrega de objetos/arquivos.",
        "rep": false
      },
      {
        "alternative": "Amazon S3.",
        "because": "Correto: S3 é ideal para hospedar arquivos estáticos (HTML, CSS, JavaScript, imagens) com alta durabilidade (99.999999999%), disponibilidade e custo-benefício. S3 pode hospedar websites estáticos completos e integra com CloudFront para distribuição global.",
        "rep": true
      }
    ]
  },
  {
    "id": 23,
    "title": "Qual serviço AWS fornece banco de dados relacional gerenciado?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Amazon DynamoDB.",
        "because": "Incorreto: DynamoDB é banco NoSQL, não relacional. A resposta correta é 'Amazon RDS', que oferece engines de banco de dados relacionais gerenciados.",
        "rep": false
      },
      {
        "alternative": "Amazon Redshift.",
        "because": "Incorreto: Redshift é data warehouse para analytics, não DB transacional. A resposta correta é 'Amazon RDS', para cargas transacionais OLTP relacionais.",
        "rep": false
      },
      {
        "alternative": "Amazon RDS (Relational Database Service).",
        "because": "Correto: RDS facilita configurar, operar e escalar bancos de dados relacionais na nuvem (MySQL, PostgreSQL, Oracle, SQL Server, MariaDB, Aurora). AWS gerencia backups, patching, replicação e recuperação automaticamente.",
        "rep": true
      },
      {
        "alternative": "Amazon S3.",
        "because": "Incorreto: S3 é armazenamento de objetos, não banco de dados. A resposta correta é 'Amazon RDS', serviço específico para bancos relacionais.",
        "rep": false
      }
    ]
  },
  {
    "id": 24,
    "title": "Para que serve o AWS Lambda?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Criar redes virtuais privadas isoladas.",
        "because": "Incorreto: Isso é função do VPC. A resposta correta é 'Executar código sem gerenciar servidores', que é o propósito fundamental do Lambda.",
        "rep": false
      },
      {
        "alternative": "Armazenar grandes volumes de dados estruturados.",
        "because": "Incorreto: Armazenamento é função de S3 ou databases. A resposta correta é 'Executar código sem gerenciar servidores', pois Lambda é serviço de computação serverless.",
        "rep": false
      },
      {
        "alternative": "Executar código sem provisionar ou gerenciar servidores.",
        "because": "Correto: Lambda é serviço de computação serverless que executa código em resposta a eventos (uploads S3, mudanças DynamoDB, requisições HTTP via API Gateway). Você paga apenas pelo tempo de computação consumido, sem gerenciar infraestrutura.",
        "rep": true
      },
      {
        "alternative": "Gerenciar permissões e políticas de acesso.",
        "because": "Incorreto: Isso é função do IAM. A resposta correta é 'Executar código sem gerenciar servidores', pois Lambda executa funções orientadas a eventos.",
        "rep": false
      }
    ]
  },
  {
    "id": 25,
    "title": "Qual serviço AWS distribui conteúdo para usuários globalmente com baixa latência?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon S3.",
        "because": "Incorreto: S3 armazena objetos mas não é CDN otimizado para distribuição global. A resposta correta é 'Amazon CloudFront', que usa edge locations para cache próximo aos usuários.",
        "rep": false
      },
      {
        "alternative": "AWS Direct Connect.",
        "because": "Incorreto: Direct Connect é conexão dedicada entre on-premises e AWS. A resposta correta é 'Amazon CloudFront', rede de distribuição de conteúdo global.",
        "rep": false
      },
      {
        "alternative": "Amazon CloudFront.",
        "because": "Correto: CloudFront é serviço de CDN (Content Delivery Network) que distribui conteúdo através de rede global de edge locations, reduzindo latência ao entregar conteúdo do local mais próximo ao usuário. Integra com S3, EC2, ELB e pode acelerar sites dinâmicos e estáticos.",
        "rep": true
      },
      {
        "alternative": "Amazon VPC.",
        "because": "Incorreto: VPC cria redes virtuais, não distribui conteúdo. A resposta correta é 'Amazon CloudFront', serviço específico de CDN para entrega de conteúdo com baixa latência.",
        "rep": false
      }
    ]
  },
  {
    "id": 26,
    "title": "O que é Amazon VPC?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Ferramenta de monitoramento de logs e métricas.",
        "because": "Incorreto: Isso é CloudWatch. A resposta correta é 'Rede virtual isolada', pois VPC fornece isolamento de rede para recursos AWS.",
        "rep": false
      },
      {
        "alternative": "Sistema de armazenamento de arquivos compartilhado.",
        "because": "Incorreto: Isso é EFS. A resposta correta é 'Rede virtual isolada', que define a função fundamental do VPC como serviço de rede.",
        "rep": false
      },
      {
        "alternative": "Rede virtual logicamente isolada onde você pode lançar recursos AWS.",
        "because": "Correto: VPC (Virtual Private Cloud) permite criar rede virtual com controle completo sobre ambiente de rede, incluindo seleção de range de IPs, criação de subnets, configuração de tabelas de roteamento e gateways de rede.",
        "rep": true
      },
      {
        "alternative": "Serviço de banco de dados NoSQL de alta performance.",
        "because": "Incorreto: Isso é DynamoDB. A resposta correta é 'Rede virtual isolada', pois VPC é serviço de networking para criar ambientes de rede privados.",
        "rep": false
      }
    ]
  },
  {
    "id": 27,
    "title": "Qual serviço AWS ajuda a distribuir tráfego entre múltiplas instâncias EC2?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon CloudFront.",
        "because": "Incorreto: CloudFront é CDN para conteúdo, não balanceador. A resposta correta é 'Elastic Load Balancing', projetado especificamente para distribuir tráfego entre instâncias.",
        "rep": false
      },
      {
        "alternative": "AWS Auto Scaling.",
        "because": "Incorreto: Auto Scaling adiciona/remove instâncias, mas ELB distribui tráfego entre elas. A resposta correta é 'Elastic Load Balancing', que balanceia carga entre recursos disponíveis.",
        "rep": false
      },
      {
        "alternative": "Elastic Load Balancing (ELB).",
        "because": "Correto: ELB distribui automaticamente tráfego de entrada entre múltiplos destinos (EC2, containers, IPs) em uma ou mais AZs, aumentando disponibilidade. Tipos incluem Application Load Balancer (camada 7), Network Load Balancer (camada 4) e Gateway Load Balancer.",
        "rep": true
      },
      {
        "alternative": "Amazon Route 53.",
        "because": "Incorreto: Route 53 é DNS, pode rotear mas não é load balancer. A resposta correta é 'Elastic Load Balancing', que distribui tráfego e monitora saúde dos destinos.",
        "rep": false
      }
    ]
  },
  {
    "id": 28,
    "title": "O que o Amazon DynamoDB fornece?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de cache em memória como Redis ou Memcached.",
        "because": "Incorreto: Isso é ElastiCache. A resposta correta é 'Banco NoSQL totalmente gerenciado', pois DynamoDB é banco persistente, não cache volátil.",
        "rep": false
      },
      {
        "alternative": "Data warehouse para análise de petabytes de dados.",
        "because": "Incorreto: Isso é Redshift. A resposta correta é 'Banco NoSQL totalmente gerenciado', pois DynamoDB é para workloads operacionais de alta performance, não analytics.",
        "rep": false
      },
      {
        "alternative": "Banco de dados NoSQL totalmente gerenciado com performance de milissegundos.",
        "because": "Correto: DynamoDB é banco chave-valor e documento totalmente gerenciado, serverless, com escalabilidade automática, replicação multi-region opcional e performance consistente independente da escala. Ideal para mobile, web, gaming, IoT.",
        "rep": true
      },
      {
        "alternative": "Banco de dados relacional com suporte completo a SQL e joins.",
        "because": "Incorreto: Isso é RDS/Aurora. A resposta correta é 'Banco NoSQL totalmente gerenciado', pois DynamoDB é otimizado para acesso por chave, não queries SQL complexas.",
        "rep": false
      }
    ]
  },
  {
    "id": 29,
    "title": "Para que serve o AWS Auto Scaling?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Monitorar performance de aplicações e gerar alertas.",
        "because": "Incorreto: Monitoramento é função do CloudWatch. A resposta correta é 'Ajustar capacidade automaticamente', pois Auto Scaling toma ações de escala baseado em métricas.",
        "rep": false
      },
      {
        "alternative": "Fazer backup automático de dados em múltiplas regiões.",
        "because": "Incorreto: Backup é função de AWS Backup ou features de serviço. A resposta correta é 'Ajustar capacidade automaticamente', pois Auto Scaling gerencia escala de compute.",
        "rep": false
      },
      {
        "alternative": "Ajustar automaticamente capacidade de recursos para manter performance constante ao menor custo.",
        "because": "Correto: Auto Scaling monitora aplicações e automaticamente ajusta capacidade (adiciona/remove EC2, ECS tasks, DynamoDB throughput) baseado em condições definidas (métricas, schedule, target tracking), mantendo disponibilidade e otimizando custos.",
        "rep": true
      },
      {
        "alternative": "Distribuir tráfego uniformemente entre servidores existentes.",
        "because": "Incorreto: Isso é função do Load Balancer. A resposta correta é 'Ajustar capacidade automaticamente', pois Auto Scaling muda número de recursos, não distribui tráfego.",
        "rep": false
      }
    ]
  },
  {
    "id": 30,
    "title": "Qual serviço AWS fornece sistema de arquivos compartilhado escalável?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon Glacier.",
        "because": "Incorreto: Glacier é para arquivamento de longo prazo com acesso infrequente. A resposta correta é 'Amazon EFS', para acesso compartilhado frequente a arquivos.",
        "rep": false
      },
      {
        "alternative": "Amazon EFS (Elastic File System).",
        "because": "Correto: EFS fornece sistema de arquivos NFS elástico e totalmente gerenciado que pode ser montado simultaneamente por múltiplas instâncias EC2 (Linux), escalando automaticamente conforme adiciona/remove arquivos. Ideal para workloads que precisam de acesso compartilhado a arquivos.",
        "rep": true
      },
      {
        "alternative": "Amazon EBS (Elastic Block Store).",
        "because": "Incorreto: EBS fornece volumes de bloco anexados a uma única instância. A resposta correta é 'Amazon EFS', que permite acesso simultâneo de múltiplas instâncias.",
        "rep": false
      },
      {
        "alternative": "Amazon S3.",
        "because": "Incorreto: S3 é object storage acessado via API, não sistema de arquivos. A resposta correta é 'Amazon EFS', que fornece sistema de arquivos com protocolo NFS.",
        "rep": false
      }
    ]
  },
  {
    "id": 31,
    "title": "Como funciona o modelo de precificação 'pay-as-you-go' da AWS?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Você paga taxa mensal fixa independente do uso.",
        "because": "Incorreto: Isso seria precificação flat/fixa. A resposta correta é 'Pagar apenas pelo consumo', onde custo varia proporcionalmente ao uso.",
        "rep": false
      },
      {
        "alternative": "Você deve pagar antecipadamente por toda capacidade que planeja usar no ano.",
        "because": "Incorreto: Isso seria modelo de reserva antecipada, não pay-as-you-go. A resposta correta é 'Pagar apenas pelo consumo real', sem necessidade de compromisso prévio.",
        "rep": false
      },
      {
        "alternative": "Você paga apenas pelos recursos que consome, sem contratos de longo prazo ou taxas iniciais.",
        "because": "Correto: Pay-as-you-go significa cobrança baseada em uso real (horas de computação, GB armazenados, requisições processadas) sem compromisso antecipado. Você pode aumentar ou diminuir uso conforme necessário, pagando apenas pelo consumo efetivo.",
        "rep": true
      },
      {
        "alternative": "Você precisa assinar contrato de 3 anos para usar serviços AWS.",
        "because": "Incorreto: Contratos são opcionais (RIs) para desconto, não obrigatórios. A resposta correta é 'Pagar apenas pelo consumo sem contratos', característica fundamental do pay-as-you-go.",
        "rep": false
      }
    ]
  },
  {
    "id": 32,
    "title": "O que são Reserved Instances (RIs) no EC2?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Instâncias que podem ser interrompidas pela AWS a qualquer momento.",
        "because": "Incorreto: Isso descreve Spot Instances. A resposta correta é 'Compromisso de 1 ou 3 anos com desconto', pois RIs garantem capacidade reservada.",
        "rep": false
      },
      {
        "alternative": "Cobram o mesmo preço que instâncias On-Demand.",
        "because": "Incorreto: RIs oferecem desconto substancial. A resposta correta é 'Compromisso com desconto significativo', diferencial principal das RIs.",
        "rep": false
      },
      {
        "alternative": "Compromisso de 1 ou 3 anos que fornece desconto significativo comparado a On-Demand.",
        "because": "Correto: RIs oferecem até 75% de desconto sobre preço On-Demand em troca de compromisso de termo (1 ou 3 anos). Ideal para workloads com uso previsível e contínuo. Opções incluem Standard (maior desconto, menos flexibilidade) e Convertible (troca de tipo de instância).",
        "rep": true
      },
      {
        "alternative": "Instâncias gratuitas disponíveis no Free Tier.",
        "because": "Incorreto: Free Tier é separado de RIs. A resposta correta é 'Compromisso de 1 ou 3 anos com desconto', modelo de precificação com compromisso para reduzir custos.",
        "rep": false
      }
    ]
  },
  {
    "id": 33,
    "title": "Qual ferramenta AWS ajuda a visualizar e analisar seus custos?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon CloudWatch.",
        "because": "Incorreto: CloudWatch monitora performance/métricas técnicas, não custos. A resposta correta é 'AWS Cost Explorer', focado em visualização e análise de gastos.",
        "rep": false
      },
      {
        "alternative": "AWS Config.",
        "because": "Incorreto: Config audita configurações de recursos, não custos. A resposta correta é 'AWS Cost Explorer', projetado para análise de custos e uso.",
        "rep": false
      },
      {
        "alternative": "AWS Cost Explorer.",
        "because": "Correto: Cost Explorer fornece interface para visualizar, entender e gerenciar custos e uso da AWS ao longo do tempo. Permite criar relatórios customizados, identificar tendências, prever gastos futuros e descobrir oportunidades de economia.",
        "rep": true
      },
      {
        "alternative": "AWS CloudTrail.",
        "because": "Incorreto: CloudTrail registra atividades de API, não analisa custos. A resposta correta é 'AWS Cost Explorer', ferramenta específica para análise financeira e billing.",
        "rep": false
      }
    ]
  },
  {
    "id": 34,
    "title": "Para que serve o AWS Budgets?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Processar pagamentos de faturas AWS.",
        "because": "Incorreto: Processamento de pagamento é feito pelo sistema de billing. A resposta correta é 'Definir orçamentos e alertas', pois Budgets é ferramenta de monitoramento, não pagamento.",
        "rep": false
      },
      {
        "alternative": "Automaticamente desligar recursos quando orçamento é excedido.",
        "because": "Incorreto: Budgets alerta mas não desliga recursos automaticamente (requer automação adicional). A resposta correta é 'Definir orçamentos e receber alertas', função principal do Budgets.",
        "rep": false
      },
      {
        "alternative": "Definir orçamentos customizados e receber alertas quando custos ou uso excederem limites.",
        "because": "Correto: AWS Budgets permite criar orçamentos para custos, uso, RIs/Savings Plans e receber notificações (email, SNS) quando valores reais ou previstos excederem thresholds definidos, permitindo controle proativo de gastos.",
        "rep": true
      },
      {
        "alternative": "Aplicar descontos automáticos em todos os serviços.",
        "because": "Incorreto: Budgets não aplica descontos. A resposta correta é 'Definir orçamentos e alertas', para controle e visibilidade de gastos.",
        "rep": false
      }
    ]
  },
  {
    "id": 35,
    "title": "Quais são os planos de AWS Support disponíveis?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Todos os planos são pagos, sem opção gratuita.",
        "because": "Incorreto: Basic é gratuito para todos. A resposta correta é 'Basic, Developer, Business e Enterprise', incluindo opção gratuita e pagas.",
        "rep": false
      },
      {
        "alternative": "Basic, Developer, Business e Enterprise.",
        "because": "Correto: AWS oferece 4 níveis: Basic (gratuito, documentação e fóruns), Developer (suporte técnico via email, horário comercial), Business (suporte 24/7, telefone, resposta rápida, acesso completo ao Trusted Advisor) e Enterprise (TAM dedicado, resposta em 15min para críticos).",
        "rep": true
      },
      {
        "alternative": "Standard e Premium apenas.",
        "because": "Incorreto: Esses não são os nomes dos planos AWS. A resposta correta é 'Basic, Developer, Business e Enterprise', os quatro níveis oficiais.",
        "rep": false
      },
      {
        "alternative": "Apenas um plano gratuito para todos os clientes.",
        "because": "Incorreto: Há múltiplos planos com recursos diferentes. A resposta correta é 'Basic, Developer, Business e Enterprise', oferecendo opções conforme necessidades.",
        "rep": false
      }
    ]
  },
  {
    "id": 36,
    "title": "O que o AWS Trusted Advisor faz?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Monitora métricas de aplicação em tempo real.",
        "because": "Incorreto: Monitoramento em tempo real é CloudWatch. A resposta correta é 'Fornece recomendações', pois Trusted Advisor faz verificações periódicas, não monitoramento contínuo.",
        "rep": false
      },
      {
        "alternative": "Executa backups automáticos de todos os recursos AWS.",
        "because": "Incorreto: Backup é função de AWS Backup ou features de serviço. A resposta correta é 'Fornece recomendações de melhores práticas', pois Trusted Advisor é ferramenta consultiva.",
        "rep": false
      },
      {
        "alternative": "Fornece recomendações automatizadas de melhores práticas em custo, performance, segurança e resiliência.",
        "because": "Correto: Trusted Advisor verifica seu ambiente AWS e sugere otimizações em 5 pilares: cost optimization, performance, security, fault tolerance e service limits. Alguns checks são gratuitos; acesso completo requer plano Business ou Enterprise.",
        "rep": true
      },
      {
        "alternative": "Gerencia permissões de usuários e roles IAM.",
        "because": "Incorreto: Gerenciamento de permissões é IAM. A resposta correta é 'Fornece recomendações de melhores práticas', incluindo recomendações de segurança IAM.",
        "rep": false
      }
    ]
  },
  {
    "id": 37,
    "title": "Como tags de alocação de custos ajudam no gerenciamento de billing?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Impedem que recursos sejam deletados acidentalmente.",
        "because": "Incorreto: Proteção contra deleção usa outros mecanismos. A resposta correta é 'Categorizar e rastrear custos', função primária das cost allocation tags.",
        "rep": false
      },
      {
        "alternative": "Permitem categorizar e rastrear custos por projeto, departamento ou ambiente.",
        "because": "Correto: Tags são pares chave-valor aplicados a recursos que aparecem em relatórios de custo detalhados, permitindo alocar gastos por unidade de negócio, centro de custo, projeto ou qualquer outra dimensão relevante para chargeback/showback.",
        "rep": true
      },
      {
        "alternative": "Automaticamente reduzem custos em 30% quando aplicadas.",
        "because": "Incorreto: Tags organizam custos, não reduzem automaticamente. A resposta correta é 'Categorizar e rastrear custos', pois tags fornecem visibilidade para otimização.",
        "rep": false
      },
      {
        "alternative": "São obrigatórias para usar qualquer serviço AWS.",
        "because": "Incorreto: Tags são opcionais (mas recomendadas). A resposta correta é 'Categorizar e rastrear custos', sendo best practice, não requisito.",
        "rep": false
      }
    ]
  },
  {
    "id": 38,
    "title": "O que são Spot Instances?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Custam o mesmo que instâncias On-Demand.",
        "because": "Incorreto: Spot oferece descontos substanciais. A resposta correta é 'Desconto até 90% com possível interrupção', principal característica das Spot.",
        "rep": false
      },
      {
        "alternative": "São ideais para bancos de dados de produção críticos.",
        "because": "Incorreto: Workloads críticos precisam de disponibilidade garantida. A resposta correta é 'Desconto com possível interrupção', inadequado para aplicações que não toleram interrupção.",
        "rep": false
      },
      {
        "alternative": "Garantem disponibilidade contínua com desconto de longo prazo.",
        "because": "Incorreto: Isso descreve Reserved Instances. A resposta correta é 'Desconto até 90% com possível interrupção', trade-off das Spot Instances.",
        "rep": false
      },
      {
        "alternative": "Instâncias EC2 com desconto de até 90% que podem ser interrompidas pela AWS quando capacidade é necessária.",
        "because": "Correto: Spot Instances aproveitam capacidade ociosa da AWS com grandes descontos. AWS pode interromper com 2 minutos de aviso quando precisa da capacidade. Ideal para workloads tolerantes a falhas: batch processing, análise de dados, testes.",
        "rep": true
      }
    ]
  },
  {
    "id": 39,
    "title": "O que o AWS Free Tier oferece?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Requer pagamento antecipado para ativar os benefícios.",
        "because": "Incorreto: Free Tier não requer pagamento (apenas validação de cartão). A resposta correta é 'Uso gratuito com limites', sendo genuinamente gratuito dentro dos limites estabelecidos.",
        "rep": false
      },
      {
        "alternative": "Disponível apenas para organizações educacionais.",
        "because": "Incorreto: Free Tier está disponível para todos os novos clientes AWS. A resposta correta é 'Uso gratuito por 12 meses e ofertas permanentes', sem restrição de tipo de conta.",
        "rep": false
      },
      {
        "alternative": "Todos os serviços AWS completamente gratuitos sem limites.",
        "because": "Incorreto: Free Tier tem limites específicos por serviço. A resposta correta é 'Uso gratuito com limites e períodos definidos', pois há restrições claras.",
        "rep": false
      },
      {
        "alternative": "Uso gratuito de serviços por 12 meses, além de ofertas sempre gratuitas e trials.",
        "because": "Correto: Free Tier inclui: (1) 12 meses de uso gratuito após signup (750h EC2 t2.micro/mês, 5GB S3), (2) sempre gratuito para certos serviços (1M Lambda requests/mês, 25GB DynamoDB), (3) trials curtos de novos serviços.",
        "rep": true
      }
    ]
  },
  {
    "id": 40,
    "title": "Qual é o benefício do AWS Savings Plans?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Aplicável somente a serviços de armazenamento como S3.",
        "because": "Incorreto: Savings Plans são para compute (EC2, Lambda, Fargate). A resposta correta é 'Compromisso de gasto em compute', não storage.",
        "rep": false
      },
      {
        "alternative": "Não requer nenhum compromisso de uso ou gasto.",
        "because": "Incorreto: Savings Plans requerem compromisso de gasto. A resposta correta é 'Compromisso de gasto com flexibilidade', pois há termo definido.",
        "rep": false
      },
      {
        "alternative": "Compromisso de gasto por hora ($/h) que oferece desconto e flexibilidade entre tipos de instância e regiões.",
        "because": "Correto: Savings Plans oferecem até 72% de desconto em troca de compromisso de gasto (ex: $10/hora) por 1 ou 3 anos. Mais flexível que RIs, permitindo mudança de tipo de instância, região e até serviços (Compute Savings Plans: EC2, Lambda, Fargate).",
        "rep": true
      },
      {
        "alternative": "Sempre mais caro que modelo pay-as-you-go.",
        "because": "Incorreto: Savings Plans oferecem descontos significativos. A resposta correta é 'Compromisso de gasto com desconto e flexibilidade', sendo opção econômica com mais flexibilidade que RIs.",
        "rep": false
      }
    ]
  },
  {
    "id": 41,
    "title": "O que significa o termo 'escalabilidade vertical' (vertical scaling) na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Distribuir carga entre múltiplos servidores menores.",
        "because": "Incorreto: Isso descreve escalabilidade horizontal. A resposta correta é 'Aumentar recursos de uma única instância', pois vertical scaling significa adicionar mais poder a um servidor existente.",
        "rep": false
      },
      {
        "alternative": "Aumentar recursos (CPU, RAM) de uma única instância existente.",
        "because": "Correto: Escalabilidade vertical significa aumentar a capacidade de um servidor individual, mudando para um tipo de instância maior (ex: de t3.medium para t3.xlarge). Tem limites físicos mas é mais simples para aplicações não projetadas para distribuição.",
        "rep": true
      },
      {
        "alternative": "Mover aplicação para região geográfica diferente.",
        "because": "Incorreto: Isso é migração de região, não escalabilidade. A resposta correta é 'Aumentar recursos de uma única instância', que define vertical scaling.",
        "rep": false
      },
      {
        "alternative": "Replicar dados em múltiplas zonas de disponibilidade.",
        "because": "Incorreto: Isso é alta disponibilidade ou redundância. A resposta correta é 'Aumentar recursos de uma única instância', conceito específico de vertical scaling.",
        "rep": false
      }
    ]
  },
  {
    "id": 42,
    "title": "Qual é a diferença principal entre escalabilidade horizontal e vertical?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Horizontal adiciona mais instâncias; vertical aumenta recursos de instância existente.",
        "because": "Correto: Escalabilidade horizontal (scale out) adiciona mais servidores ao pool. Vertical (scale up) aumenta CPU/RAM da instância existente. Horizontal é preferível para alta disponibilidade e não tem limite teórico; vertical é mais simples mas tem limite de hardware.",
        "rep": true
      },
      {
        "alternative": "Horizontal é sempre mais cara que vertical.",
        "because": "Incorreto: Custo depende do caso de uso e padrão de carga. A resposta correta é 'Horizontal adiciona instâncias; vertical aumenta recursos', que define a diferença fundamental.",
        "rep": false
      },
      {
        "alternative": "Vertical só funciona com bancos de dados relacionais.",
        "because": "Incorreto: Ambas as abordagens aplicam-se a diversos tipos de aplicação. A resposta correta é 'Horizontal adiciona instâncias; vertical aumenta recursos', diferença que transcende tipo de aplicação.",
        "rep": false
      },
      {
        "alternative": "Não há diferença real, são termos sinônimos.",
        "because": "Incorreto: São conceitos completamente diferentes. A resposta correta é 'Horizontal adiciona instâncias; vertical aumenta recursos', que são estratégias distintas de escalabilidade.",
        "rep": false
      }
    ]
  },
  {
    "id": 43,
    "title": "O que caracteriza um ambiente híbrido (hybrid cloud) na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Usar apenas serviços gerenciados sem acesso a infraestrutura.",
        "because": "Incorreto: Isso descreve PaaS/SaaS, não arquitetura híbrida. A resposta correta é 'Integrar infraestrutura on-premises com recursos AWS', definição de hybrid cloud.",
        "rep": false
      },
      {
        "alternative": "Combinar múltiplos provedores de nuvem diferentes.",
        "because": "Incorreto: Isso é multi-cloud, não híbrido. A resposta correta é 'Integrar on-premises com AWS', pois híbrido conecta nuvem pública com ambiente local.",
        "rep": false
      },
      {
        "alternative": "Usar somente nuvem pública sem componentes locais.",
        "because": "Incorreto: Isso é nuvem pública pura, oposto de híbrido. A resposta correta é 'Integrar on-premises com AWS', que é a essência do modelo híbrido.",
        "rep": false
      },
      {
        "alternative": "Integrar infraestrutura on-premises com recursos AWS na nuvem.",
        "because": "Correto: Hybrid cloud combina recursos locais (on-premises) com nuvem pública AWS, conectados via VPN ou Direct Connect. Permite migração gradual, atender requisitos de compliance que exigem dados locais, ou usar nuvem para burst capacity.",
        "rep": true
      }
    ]
  },
  {
    "id": 44,
    "title": "O que é 'fault tolerance' (tolerância a falhas) na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Reduzir custos eliminando recursos redundantes.",
        "because": "Incorreto: Fault tolerance geralmente requer redundância, aumentando custos. A resposta correta é 'Sistema continua operando mesmo com falhas', definição de tolerância a falhas.",
        "rep": false
      },
      {
        "alternative": "Executar aplicações em uma única zona para simplificar gestão.",
        "because": "Incorreto: Zona única cria ponto único de falha. A resposta correta é 'Sistema continua operando mesmo com falhas', que requer redundância multi-AZ.",
        "rep": false
      },
      {
        "alternative": "Capacidade do sistema continuar operando corretamente mesmo quando componentes falham.",
        "because": "Correto: Fault tolerance significa que o sistema tem redundância suficiente para continuar funcionando sem interrupção mesmo quando componentes individuais falham. Implementado através de multi-AZ deployment, replicação de dados e componentes redundantes.",
        "rep": true
      },
      {
        "alternative": "Fazer backup dos dados uma vez por semana.",
        "because": "Incorreto: Backup é recuperação de desastres, não tolerância a falhas em tempo real. A resposta correta é 'Sistema continua operando mesmo com falhas', operação contínua sem interrupção.",
        "rep": false
      }
    ]
  },
  {
    "id": 45,
    "title": "Qual modelo de serviço em nuvem oferece mais controle sobre infraestrutura?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "PaaS (Platform as a Service).",
        "because": "Incorreto: PaaS abstrai a infraestrutura, oferecendo menos controle que IaaS. A resposta correta é 'IaaS', que fornece controle sobre virtualização, servidores, armazenamento e rede.",
        "rep": false
      },
      {
        "alternative": "SaaS (Software as a Service).",
        "because": "Incorreto: SaaS oferece o menor controle, apenas uso da aplicação. A resposta correta é 'IaaS', que permite gerenciar sistema operacional e camadas inferiores.",
        "rep": false
      },
      {
        "alternative": "IaaS (Infrastructure as a Service).",
        "because": "Correto: IaaS oferece máximo controle sobre infraestrutura de TI, permitindo gerenciar sistema operacional, aplicações, middleware e dados. Você controla tudo exceto a camada física de hardware e virtualização.",
        "rep": true
      },
      {
        "alternative": "Todos os modelos oferecem o mesmo nível de controle.",
        "because": "Incorreto: Há clara hierarquia de controle: IaaS > PaaS > SaaS. A resposta correta é 'IaaS', que oferece controle máximo.",
        "rep": false
      }
    ]
  },
  {
    "id": 46,
    "title": "O que significa 'disaster recovery' (recuperação de desastres) na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Substituir completamente necessidade de backups.",
        "because": "Incorreto: DR inclui estratégia de backup como componente. A resposta correta é 'Capacidade de recuperar operações após evento catastrófico', que abrange backup e mais.",
        "rep": false
      },
      {
        "alternative": "Capacidade de recuperar operações de TI após evento catastrófico usando backups e recursos secundários.",
        "because": "Correto: Disaster Recovery é conjunto de políticas e procedimentos para recuperar infraestrutura e dados após desastre (falha de datacenter, desastre natural, cyberattaque). AWS oferece várias estratégias: backup/restore, pilot light, warm standby, multi-site.",
        "rep": true
      },
      {
        "alternative": "Executar aplicações simultaneamente em múltiplas regiões o tempo todo.",
        "because": "Incorreto: Isso é estratégia multi-site/active-active, apenas um tipo de DR. A resposta correta é 'Capacidade de recuperar operações após desastre', conceito mais amplo.",
        "rep": false
      },
      {
        "alternative": "Monitorar logs de aplicação para detectar erros.",
        "because": "Incorreto: Isso é monitoramento operacional, não DR. A resposta correta é 'Capacidade de recuperar operações após desastre', focado em continuidade do negócio.",
        "rep": false
      }
    ]
  },
  {
    "id": 47,
    "title": "Qual é o objetivo do conceito 'loose coupling' (baixo acoplamento) em arquiteturas de nuvem?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Aumentar dependências diretas entre componentes do sistema.",
        "because": "Incorreto: Loose coupling visa reduzir dependências, não aumentá-las. A resposta correta é 'Reduzir interdependências para que componentes possam mudar independentemente', definição de baixo acoplamento.",
        "rep": false
      },
      {
        "alternative": "Exigir que todos os componentes sejam modificados simultaneamente.",
        "because": "Incorreto: Isso é tight coupling (alto acoplamento). A resposta correta é 'Reduzir interdependências', permitindo mudanças independentes.",
        "rep": false
      },
      {
        "alternative": "Fazer todos os serviços compartilharem o mesmo banco de dados.",
        "because": "Incorreto: Compartilhar banco cria acoplamento forte. A resposta correta é 'Reduzir interdependências', geralmente usando bancos separados e comunicação via APIs.",
        "rep": false
      },
      {
        "alternative": "Reduzir interdependências entre componentes para que possam mudar independentemente.",
        "because": "Correto: Loose coupling significa que mudanças em um componente têm impacto mínimo em outros. Implementado usando filas (SQS), mensagens (SNS), APIs e eventos. Aumenta resiliência, facilita manutenção e permite escalabilidade independente.",
        "rep": true
      }
    ]
  },
  {
    "id": 48,
    "title": "O que é 'latency' (latência) no contexto de computação em nuvem?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Quantidade total de dados transferidos pela rede.",
        "because": "Incorreto: Isso é throughput ou volume de dados. A resposta correta é 'Tempo de atraso entre requisição e resposta', que define latência.",
        "rep": false
      },
      {
        "alternative": "Custo mensal de usar serviços de rede.",
        "because": "Incorreto: Isso é custo de networking. A resposta correta é 'Tempo de atraso', medida de performance, não custo.",
        "rep": false
      },
      {
        "alternative": "Tempo de atraso entre envio de requisição e recebimento da resposta.",
        "because": "Correto: Latência é o tempo que leva para dados viajarem de origem ao destino. Afetada por distância física, qualidade de rede e processamento. AWS reduz latência usando edge locations, CloudFront e múltiplas regiões próximas aos usuários.",
        "rep": true
      },
      {
        "alternative": "Número de usuários simultâneos que sistema pode atender.",
        "because": "Incorreto: Isso é capacidade ou throughput de usuários. A resposta correta é 'Tempo de atraso', medida temporal, não volumétrica.",
        "rep": false
      }
    ]
  },
  {
    "id": 49,
    "title": "Qual é o benefício principal de usar 'microservices' (microsserviços) na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Reduzir complexidade concentrando toda lógica em único serviço monolítico.",
        "because": "Incorreto: Isso é arquitetura monolítica, oposto de microservices. A resposta correta é 'Dividir aplicação em serviços pequenos e independentes', essência dos microsserviços.",
        "rep": false
      },
      {
        "alternative": "Dividir aplicação em serviços pequenos, independentes e especializados que se comunicam via APIs.",
        "because": "Correto: Microservices permitem que cada serviço seja desenvolvido, implantado e escalado independentemente. Facilita agilidade, permite usar tecnologias diferentes por serviço, melhora resiliência (falha isolada) e suporta equipes autônomas.",
        "rep": true
      },
      {
        "alternative": "Garantir que todos os serviços usem mesma linguagem de programação.",
        "because": "Incorreto: Microservices permitem polyglot (múltiplas linguagens). A resposta correta é 'Dividir em serviços independentes', permitindo escolhas tecnológicas por serviço.",
        "rep": false
      },
      {
        "alternative": "Eliminar necessidade de APIs e comunicação entre serviços.",
        "because": "Incorreto: Microservices dependem fortemente de APIs para comunicação. A resposta correta é 'Dividir em serviços independentes que se comunicam via APIs', onde APIs são essenciais.",
        "rep": false
      }
    ]
  },
  {
    "id": 50,
    "title": "O que representa o 'Well-Architected Framework' da AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Conjunto de melhores práticas e princípios de design para arquiteturas na nuvem em 6 pilares.",
        "because": "Correto: Well-Architected Framework fornece orientação em 6 pilares: Operational Excellence, Security, Reliability, Performance Efficiency, Cost Optimization e Sustainability. Inclui questões de revisão, melhores práticas e ferramentas para avaliar arquiteturas.",
        "rep": true
      },
      {
        "alternative": "Ferramenta de precificação para calcular custos AWS.",
        "because": "Incorreto: Isso é AWS Pricing Calculator. A resposta correta é 'Conjunto de melhores práticas em 6 pilares', framework de arquitetura, não ferramenta de custo.",
        "rep": false
      },
      {
        "alternative": "Serviço de monitoramento de performance de aplicações.",
        "because": "Incorreto: Isso é CloudWatch ou X-Ray. A resposta correta é 'Conjunto de melhores práticas', framework conceitual, não serviço de monitoramento.",
        "rep": false
      },
      {
        "alternative": "Tipo específico de instância EC2 para workloads críticos.",
        "because": "Incorreto: Well-Architected não é tipo de instância. A resposta correta é 'Conjunto de melhores práticas', framework de design de arquitetura.",
        "rep": false
      }
    ]
  },
  {
    "id": 51,
    "title": "O que são Security Groups na AWS?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Grupos de usuários IAM com mesmas permissões.",
        "because": "Incorreto: Isso são IAM Groups. A resposta correta é 'Firewall virtual stateful controlando tráfego de entrada/saída', que define Security Groups.",
        "rep": false
      },
      {
        "alternative": "Firewall virtual stateful que controla tráfego de entrada e saída de instâncias EC2.",
        "because": "Correto: Security Groups atuam como firewall na camada de instância, permitindo ou negando tráfego baseado em regras (protocolo, porta, origem/destino). São stateful: tráfego de resposta é automaticamente permitido. Funciona por allow (não há deny explícito).",
        "rep": true
      },
      {
        "alternative": "Certificados SSL/TLS para criptografar dados em trânsito.",
        "because": "Incorreto: Isso é ACM (AWS Certificate Manager) ou certificados. A resposta correta é 'Firewall virtual', Security Groups controlam acesso de rede, não criptografia.",
        "rep": false
      },
      {
        "alternative": "Serviço de backup automático de recursos AWS.",
        "because": "Incorreto: Isso é AWS Backup. A resposta correta é 'Firewall virtual', Security Groups são para controle de tráfego de rede.",
        "rep": false
      }
    ]
  },
  {
    "id": 52,
    "title": "Qual serviço AWS detecta atividades anômalas e potenciais ameaças de segurança?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon S3.",
        "because": "Incorreto: S3 é armazenamento de objetos. A resposta correta é 'Amazon GuardDuty', serviço específico de detecção de ameaças.",
        "rep": false
      },
      {
        "alternative": "Amazon GuardDuty.",
        "because": "Correto: GuardDuty é serviço de detecção de ameaças que monitora continuamente atividade maliciosa e comportamento não autorizado. Analisa CloudTrail logs, VPC Flow Logs e DNS logs usando machine learning para identificar ameaças como reconhecimento, comprometimento de instância e account compromise.",
        "rep": true
      },
      {
        "alternative": "AWS Lambda.",
        "because": "Incorreto: Lambda executa código serverless. A resposta correta é 'Amazon GuardDuty', projetado para threat detection.",
        "rep": false
      },
      {
        "alternative": "Amazon CloudFront.",
        "because": "Incorreto: CloudFront é CDN. A resposta correta é 'Amazon GuardDuty', serviço de segurança para detecção de ameaças.",
        "rep": false
      }
    ]
  },
  {
    "id": 53,
    "title": "O que é AWS KMS (Key Management Service)?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de balanceamento de carga entre regiões.",
        "because": "Incorreto: Isso é Global Accelerator ou Route 53. A resposta correta é 'Serviço gerenciado para criar e controlar chaves de criptografia', função do KMS.",
        "rep": false
      },
      {
        "alternative": "Ferramenta de análise de custos e otimização financeira.",
        "because": "Incorreto: Isso é Cost Explorer ou Cost Anomaly Detection. A resposta correta é 'Serviço para gerenciar chaves de criptografia', KMS é para segurança.",
        "rep": false
      },
      {
        "alternative": "Serviço gerenciado para criar e controlar chaves de criptografia usadas em aplicações e serviços AWS.",
        "because": "Correto: KMS permite criar, gerenciar e controlar chaves criptográficas usadas para proteger dados. Integra com serviços AWS (S3, EBS, RDS) para criptografia transparente. Suporta chaves gerenciadas pela AWS, pelo cliente, e chaves customer managed com controle total.",
        "rep": true
      },
      {
        "alternative": "Sistema de monitoramento de logs em tempo real.",
        "because": "Incorreto: Isso é CloudWatch Logs. A resposta correta é 'Serviço para gerenciar chaves de criptografia', KMS é específico para key management.",
        "rep": false
      }
    ]
  },
  {
    "id": 54,
    "title": "Qual é a diferença entre Network ACL e Security Group?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Network ACL é stateful; Security Group é stateless.",
        "because": "Incorreto: É o oposto - Network ACL é stateless; Security Group é stateful. A resposta correta inverte corretamente a relação.",
        "rep": false
      },
      {
        "alternative": "Network ACL opera na camada de subnet e é stateless; Security Group opera na camada de instância e é stateful.",
        "because": "Correto: Network ACL funciona em nível de subnet, avalia regras por ordem numérica, suporta allow e deny, e é stateless (precisa regras explícitas para entrada e saída). Security Group funciona em nível de instância, avalia todas as regras, só permite allow, e é stateful (resposta automática permitida).",
        "rep": true
      },
      {
        "alternative": "São exatamente iguais, apenas nomes diferentes para mesma funcionalidade.",
        "because": "Incorreto: Têm diferenças significativas em escopo e comportamento. A resposta correta é 'NACL em subnet, stateless; SG em instância, stateful', distinguindo claramente os dois.",
        "rep": false
      },
      {
        "alternative": "Network ACL não pode negar tráfego, apenas Security Group pode.",
        "because": "Incorreto: Network ACL suporta regras deny explícitas; Security Group não. A resposta correta é 'NACL stateless em subnet; SG stateful em instância'.",
        "rep": false
      }
    ]
  },
  {
    "id": 55,
    "title": "Para que serve o AWS Secrets Manager?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Armazenar e rotacionar automaticamente credenciais, senhas e chaves de API de forma segura.",
        "because": "Correto: Secrets Manager permite armazenar, gerenciar e recuperar credenciais de banco de dados, chaves de API e outros secrets de forma centralizada e criptografada. Suporta rotação automática de credenciais sem downtime e integra-se com RDS, Redshift e outros serviços.",
        "rep": true
      },
      {
        "alternative": "Distribuir conteúdo estático globalmente via CDN.",
        "because": "Incorreto: Isso é CloudFront. A resposta correta é 'Armazenar e rotacionar credenciais', função do Secrets Manager.",
        "rep": false
      },
      {
        "alternative": "Executar varreduras de vulnerabilidades em instâncias EC2.",
        "because": "Incorreto: Isso é Amazon Inspector. A resposta correta é 'Armazenar e rotacionar credenciais', Secrets Manager gerencia secrets, não vulnerabilidades.",
        "rep": false
      },
      {
        "alternative": "Criar e gerenciar certificados SSL/TLS públicos.",
        "because": "Incorreto: Isso é AWS Certificate Manager (ACM). A resposta correta é 'Armazenar e rotacionar credenciais', Secrets Manager foca em secrets como senhas e API keys.",
        "rep": false
      }
    ]
  },
  {
    "id": 56,
    "title": "O que é Amazon Inspector?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de DNS gerenciado para roteamento de tráfego.",
        "because": "Incorreto: Isso é Route 53. A resposta correta é 'Serviço de avaliação de vulnerabilidades', função do Inspector.",
        "rep": false
      },
      {
        "alternative": "Ferramenta de visualização de custos e uso da AWS.",
        "because": "Incorreto: Isso é Cost Explorer. A resposta correta é 'Serviço de avaliação de vulnerabilidades', Inspector é para segurança.",
        "rep": false
      },
      {
        "alternative": "Serviço de avaliação automatizada de vulnerabilidades para workloads AWS.",
        "because": "Correto: Inspector automaticamente descobre e escaneia workloads (EC2, ECR containers, Lambda) procurando vulnerabilidades de software e exposições de rede não intencionais. Gera relatórios priorizados por severidade e fornece recomendações de remediação.",
        "rep": true
      },
      {
        "alternative": "Sistema de mensageria pub/sub para notificações.",
        "because": "Incorreto: Isso é SNS (Simple Notification Service). A resposta correta é 'Serviço de avaliação de vulnerabilidades', específico do Inspector.",
        "rep": false
      }
    ]
  },
  {
    "id": 57,
    "title": "Qual serviço permite criptografar dados em trânsito entre cliente e AWS?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "AWS Direct Connect exclusivamente.",
        "because": "Incorreto: Direct Connect não criptografa por padrão. A resposta correta é 'SSL/TLS (HTTPS)', protocolo padrão para criptografia em trânsito.",
        "rep": false
      },
      {
        "alternative": "SSL/TLS (HTTPS) para comunicação segura.",
        "because": "Correto: SSL/TLS criptografa dados durante transmissão entre cliente e serviços AWS. AWS suporta HTTPS endpoints em todos os serviços, e Certificate Manager (ACM) fornece certificados SSL/TLS gratuitos. VPN também usa criptografia para conexões site-to-site.",
        "rep": true
      },
      {
        "alternative": "Amazon S3 apenas.",
        "because": "Incorreto: S3 usa SSL/TLS, mas não é o único. A resposta correta é 'SSL/TLS', protocolo usado por todos os serviços AWS.",
        "rep": false
      },
      {
        "alternative": "Apenas conexões físicas dedicadas garantem criptografia.",
        "because": "Incorreto: Criptografia em trânsito é via SSL/TLS, independente do tipo de conexão. A resposta correta é 'SSL/TLS', não tipo de conexão física.",
        "rep": false
      }
    ]
  },
  {
    "id": 58,
    "title": "O que é AWS Organizations?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço para gerenciar centralmente múltiplas contas AWS e aplicar políticas em escala.",
        "because": "Correto: Organizations permite consolidar múltiplas contas AWS em organização hierárquica. Oferece billing consolidado, aplicação centralizada de políticas (SCPs - Service Control Policies), automação de criação de contas e controle de acesso em escala.",
        "rep": true
      },
      {
        "alternative": "Ferramenta de organização de arquivos em buckets S3.",
        "because": "Incorreto: S3 tem sua própria organização via prefixos/folders. A resposta correta é 'Gerenciar múltiplas contas AWS', escopo de Organizations é contas, não arquivos.",
        "rep": false
      },
      {
        "alternative": "Sistema de workflow para automação de tarefas repetitivas.",
        "because": "Incorreto: Isso é Step Functions ou Systems Manager. A resposta correta é 'Gerenciar múltiplas contas', função específica do Organizations.",
        "rep": false
      },
      {
        "alternative": "Banco de dados para armazenar dados organizacionais.",
        "because": "Incorreto: Organizations não é banco de dados. A resposta correta é 'Gerenciar múltiplas contas AWS', serviço de governança de contas.",
        "rep": false
      }
    ]
  },
  {
    "id": 59,
    "title": "O que são IAM Roles e quando usá-los?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Senhas permanentes armazenadas em código da aplicação.",
        "because": "Incorreto: Isso é anti-padrão de segurança. A resposta correta é 'Identidade assumível com permissões temporárias', roles evitam credenciais hardcoded.",
        "rep": false
      },
      {
        "alternative": "Identidade AWS assumível por usuários, aplicações ou serviços para obter permissões temporárias.",
        "because": "Correto: IAM Roles concedem permissões sem necessidade de credenciais de longo prazo. Usados para: instâncias EC2 acessarem outros serviços, cross-account access, federação de identidade, e serviços AWS assumirem roles para executar ações em seu nome.",
        "rep": true
      },
      {
        "alternative": "Grupos de usuários com mesmas permissões permanentes.",
        "because": "Incorreto: Isso são IAM Groups. A resposta correta é 'Identidade assumível com permissões temporárias', diferencial dos roles.",
        "rep": false
      },
      {
        "alternative": "Chaves de acesso compartilhadas entre múltiplas aplicações.",
        "because": "Incorreto: Compartilhar chaves é má prática. A resposta correta é 'Identidade assumível temporariamente', roles eliminam necessidade de compartilhar credenciais.",
        "rep": false
      }
    ]
  },
  {
    "id": 60,
    "title": "Qual serviço AWS ajuda a garantir compliance com regulamentações como HIPAA e PCI DSS?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "AWS oferece infraestrutura compliant; cliente deve configurar corretamente e AWS Artifact fornece documentação.",
        "because": "Correto: AWS fornece infraestrutura que atende diversos frameworks (HIPAA, PCI DSS, SOC, ISO). Cliente é responsável por configurar serviços de forma compliant (modelo de responsabilidade compartilhada). AWS Artifact fornece relatórios de compliance e BAAs (Business Associate Agreements).",
        "rep": true
      },
      {
        "alternative": "Amazon S3 automaticamente garante compliance sem configuração.",
        "because": "Incorreto: S3 pode ser usado de forma compliant, mas requer configuração adequada. A resposta correta é 'AWS fornece infraestrutura; cliente configura', enfatizando responsabilidade compartilhada.",
        "rep": false
      },
      {
        "alternative": "Compliance é 100% responsabilidade da AWS, cliente não precisa fazer nada.",
        "because": "Incorreto: Cliente tem responsabilidades na nuvem. A resposta correta é 'AWS fornece infraestrutura; cliente configura corretamente', modelo de responsabilidade compartilhada.",
        "rep": false
      },
      {
        "alternative": "AWS não suporta regulamentações de compliance.",
        "because": "Incorreto: AWS tem extenso programa de compliance. A resposta correta é 'AWS fornece infraestrutura compliant e documentação via Artifact', suportando múltiplos frameworks.",
        "rep": false
      }
    ]
  },
  {
    "id": 61,
    "title": "Qual serviço AWS é usado para enviar notificações via email, SMS ou push notifications?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Amazon CloudWatch.",
        "because": "Incorreto: CloudWatch monitora recursos; SNS envia notificações. A resposta correta é 'Amazon SNS', serviço de mensageria pub/sub.",
        "rep": false
      },
      {
        "alternative": "Amazon SQS.",
        "because": "Incorreto: SQS é fila de mensagens para desacoplamento, não notificações push. A resposta correta é 'Amazon SNS', projetado para pub/sub e notificações.",
        "rep": false
      },
      {
        "alternative": "Amazon SNS (Simple Notification Service).",
        "because": "Correto: SNS é serviço de mensageria pub/sub gerenciado que envia notificações para subscribers via múltiplos protocolos: email, SMS, push notifications mobile, HTTP/HTTPS endpoints, SQS, Lambda. Permite fan-out de mensagens para múltiplos destinos simultaneamente.",
        "rep": true
      },
      {
        "alternative": "AWS Lambda.",
        "because": "Incorreto: Lambda executa código; pode ser acionado por SNS mas não é serviço de notificação. A resposta correta é 'Amazon SNS', específico para pub/sub.",
        "rep": false
      }
    ]
  },
  {
    "id": 62,
    "title": "Para que serve o Amazon SQS (Simple Queue Service)?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Banco de dados NoSQL para armazenamento de documentos.",
        "because": "Incorreto: Isso é DynamoDB. A resposta correta é 'Serviço de fila de mensagens', SQS é para messaging, não storage persistente.",
        "rep": false
      },
      {
        "alternative": "Serviço de fila de mensagens gerenciado para desacoplar componentes de aplicações distribuídas.",
        "because": "Correto: SQS permite que componentes de aplicação se comuniquem de forma assíncrona através de filas. Garante entrega de mensagens, suporta escala automática e oferece dois tipos: Standard (throughput máximo, best-effort ordering) e FIFO (ordem garantida, exactly-once processing).",
        "rep": true
      },
      {
        "alternative": "Sistema de cache em memória para acelerar queries.",
        "because": "Incorreto: Isso é ElastiCache. A resposta correta é 'Serviço de fila de mensagens', SQS é para comunicação assíncrona.",
        "rep": false
      },
      {
        "alternative": "Ferramenta de monitoramento de logs de aplicação.",
        "because": "Incorreto: Isso é CloudWatch Logs. A resposta correta é 'Serviço de fila de mensagens', SQS facilita desacoplamento via mensagens.",
        "rep": false
      }
    ]
  },
  {
    "id": 63,
    "title": "O que é Amazon Route 53?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de armazenamento de objetos com versionamento.",
        "because": "Incorreto: Isso é S3. A resposta correta é 'Serviço de DNS escalável', função do Route 53.",
        "rep": false
      },
      {
        "alternative": "Serviço de DNS escalável e altamente disponível para roteamento de tráfego.",
        "because": "Correto: Route 53 é DNS gerenciado que traduz nomes (exemplo.com) em IPs. Oferece registro de domínios, health checks, roteamento baseado em latência/geolocalização/weighted/failover, e integra-se com outros serviços AWS. Nome vem da porta DNS 53.",
        "rep": true
      },
      {
        "alternative": "Firewall de aplicação web contra ataques DDoS.",
        "because": "Incorreto: Isso é WAF e Shield. A resposta correta é 'Serviço de DNS', Route 53 faz resolução de nomes.",
        "rep": false
      },
      {
        "alternative": "Rede de entrega de conteúdo para cache global.",
        "because": "Incorreto: Isso é CloudFront. A resposta correta é 'Serviço de DNS', Route 53 roteia requisições, CloudFront cacheia conteúdo.",
        "rep": false
      }
    ]
  },
  {
    "id": 64,
    "title": "Qual serviço AWS fornece cache em memória compatível com Redis ou Memcached?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon RDS.",
        "because": "Incorreto: RDS é para bancos relacionais persistentes. A resposta correta é 'Amazon ElastiCache', serviço de cache em memória.",
        "rep": false
      },
      {
        "alternative": "Amazon ElastiCache.",
        "because": "Correto: ElastiCache é serviço de cache em memória totalmente gerenciado compatível com Redis e Memcached. Reduz latência armazenando dados frequentemente acessados na memória. Redis oferece persistência e estruturas de dados avançadas; Memcached é mais simples e multi-threaded.",
        "rep": true
      },
      {
        "alternative": "Amazon DynamoDB.",
        "because": "Incorreto: DynamoDB é banco NoSQL persistente, não cache. A resposta correta é 'Amazon ElastiCache', otimizado para cache em memória de alta performance.",
        "rep": false
      },
      {
        "alternative": "Amazon S3.",
        "because": "Incorreto: S3 é object storage durável, não cache em memória. A resposta correta é 'Amazon ElastiCache', específico para caching.",
        "rep": false
      }
    ]
  },
  {
    "id": 65,
    "title": "O que é AWS Elastic Beanstalk?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Plataforma gerenciada para deploy e scaling de aplicações web sem gerenciar infraestrutura.",
        "because": "Correto: Elastic Beanstalk é PaaS que automatiza deployment de aplicações. Você faz upload do código e o Beanstalk provisiona EC2, load balancer, auto scaling, monitoramento. Suporta Java, .NET, PHP, Node.js, Python, Ruby, Go, Docker. Você mantém controle total dos recursos subjacentes.",
        "rep": true
      },
      {
        "alternative": "Serviço de banco de dados relacional de alta disponibilidade.",
        "because": "Incorreto: Isso é RDS ou Aurora. A resposta correta é 'Plataforma para deploy de aplicações', Beanstalk é PaaS, não database.",
        "rep": false
      },
      {
        "alternative": "Sistema de arquivos distribuído para big data.",
        "because": "Incorreto: Isso seria EMR ou FSx. A resposta correta é 'Plataforma para deploy de aplicações web', função do Beanstalk.",
        "rep": false
      },
      {
        "alternative": "Ferramenta de análise de logs e métricas em tempo real.",
        "because": "Incorreto: Isso é CloudWatch. A resposta correta é 'Plataforma para deploy de aplicações', Beanstalk automatiza infraestrutura de aplicação.",
        "rep": false
      }
    ]
  },
  {
    "id": 66,
    "title": "Qual é a diferença entre Amazon EBS e Instance Store?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "EBS é armazenamento persistente em rede; Instance Store é temporário e local.",
        "because": "Correto: EBS são volumes de bloco persistentes que existem independentemente da instância EC2, podem ser anexados/desanexados, suportam snapshots e persistem após stop/start. Instance Store é armazenamento temporário fisicamente anexado ao host, dados perdidos se instância para ou falha, mas oferece I/O muito alto.",
        "rep": true
      },
      {
        "alternative": "Não há diferença, são termos sinônimos.",
        "because": "Incorreto: São tipos completamente diferentes de armazenamento. A resposta correta é 'EBS persistente em rede; Instance Store temporário local', com características distintas.",
        "rep": false
      },
      {
        "alternative": "Instance Store é mais durável que EBS.",
        "because": "Incorreto: EBS é persistente e durável; Instance Store é efêmero. A resposta correta é 'EBS persistente; Instance Store temporário', onde EBS oferece durabilidade.",
        "rep": false
      },
      {
        "alternative": "EBS não pode fazer snapshots; Instance Store pode.",
        "because": "Incorreto: EBS suporta snapshots; Instance Store não. A resposta correta é 'EBS persistente com snapshots; Instance Store temporário', invertendo corretamente.",
        "rep": false
      }
    ]
  },
  {
    "id": 67,
    "title": "Para que serve o AWS CloudFormation?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de CDN para distribuição de conteúdo global.",
        "because": "Incorreto: Isso é CloudFront. A resposta correta é 'Infrastructure as Code para provisionar recursos', função do CloudFormation.",
        "rep": false
      },
      {
        "alternative": "Infrastructure as Code: provisionar e gerenciar recursos AWS usando templates declarativos.",
        "because": "Correto: CloudFormation permite modelar infraestrutura em arquivos de texto (JSON/YAML). Define recursos como stacks, provisiona de forma consistente e repetível, suporta updates e rollbacks, e permite versionamento de infraestrutura. Elimina configuração manual e reduz erros.",
        "rep": true
      },
      {
        "alternative": "Ferramenta de backup automático de bancos de dados.",
        "because": "Incorreto: Backup é função nativa de RDS ou AWS Backup. A resposta correta é 'Infrastructure as Code', CloudFormation automatiza provisionamento, não backup.",
        "rep": false
      },
      {
        "alternative": "Sistema de monitoramento de performance de aplicações.",
        "because": "Incorreto: Isso é CloudWatch ou X-Ray. A resposta correta é 'Infrastructure as Code', CloudFormation provisiona recursos via templates.",
        "rep": false
      }
    ]
  },
  {
    "id": 68,
    "title": "O que é Amazon Redshift?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de computação serverless para executar código.",
        "because": "Incorreto: Isso é Lambda. A resposta correta é 'Data warehouse para analytics', função do Redshift.",
        "rep": false
      },
      {
        "alternative": "Data warehouse totalmente gerenciado para análise de petabytes de dados.",
        "because": "Correto: Redshift é data warehouse colunar otimizado para queries analíticas OLAP em grandes volumes de dados. Usa SQL, integra com ferramentas de BI, oferece performance através de processamento paralelo massivo (MPP) e compressão colunar. Ideal para analytics, reporting e data mining.",
        "rep": true
      },
      {
        "alternative": "Banco de dados NoSQL para aplicações de baixa latência.",
        "because": "Incorreto: Isso é DynamoDB. A resposta correta é 'Data warehouse para analytics', Redshift é OLAP, não OLTP.",
        "rep": false
      },
      {
        "alternative": "Serviço de streaming de dados em tempo real.",
        "because": "Incorreto: Isso é Kinesis. A resposta correta é 'Data warehouse', Redshift é para analytics de dados históricos.",
        "rep": false
      }
    ]
  },
  {
    "id": 69,
    "title": "Qual serviço AWS permite executar containers Docker sem gerenciar servidores?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon EC2 apenas.",
        "because": "Incorreto: EC2 requer gerenciamento de servidores. A resposta correta é 'AWS Fargate', que é serverless para containers.",
        "rep": false
      },
      {
        "alternative": "AWS Fargate.",
        "because": "Correto: Fargate é motor de computação serverless para containers que funciona com ECS (Elastic Container Service) e EKS (Elastic Kubernetes Service). Elimina necessidade de provisionar e gerenciar servidores, você especifica apenas recursos (CPU/RAM) necessários por container.",
        "rep": true
      },
      {
        "alternative": "Amazon S3.",
        "because": "Incorreto: S3 é object storage, não executa containers. A resposta correta é 'AWS Fargate', plataforma serverless para containers.",
        "rep": false
      },
      {
        "alternative": "AWS Lambda exclusivamente.",
        "because": "Incorreto: Lambda executa funções, não containers completos. A resposta correta é 'AWS Fargate', que executa containers Docker de forma serverless.",
        "rep": false
      }
    ]
  },
  {
    "id": 70,
    "title": "O que é Amazon Aurora?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de cache distribuído em memória.",
        "because": "Incorreto: Isso é ElastiCache. A resposta correta é 'Banco relacional compatível com MySQL/PostgreSQL', função do Aurora.",
        "rep": false
      },
      {
        "alternative": "Ferramenta de ETL para migração de dados.",
        "because": "Incorreto: Isso é AWS Glue ou DMS. A resposta correta é 'Banco relacional de alta performance', Aurora é database engine.",
        "rep": false
      },
      {
        "alternative": "Banco de dados relacional compatível com MySQL e PostgreSQL, até 5x mais rápido.",
        "because": "Correto: Aurora é banco relacional otimizado para nuvem, compatível com MySQL e PostgreSQL. Oferece até 5x performance de MySQL e 3x de PostgreSQL, com disponibilidade e durabilidade de bancos comerciais a 1/10 do custo. Recursos incluem replicação automática em 3 AZs, backup contínuo para S3.",
        "rep": true
      },
      {
        "alternative": "Sistema de arquivos paralelo para HPC.",
        "because": "Incorreto: Isso é FSx for Lustre. A resposta correta é 'Banco relacional compatível com MySQL/PostgreSQL', Aurora é database service.",
        "rep": false
      }
    ]
  }
]
