[
  {
    "id": 1,
    "title": "Qual é a principal vantagem do modelo de computação em nuvem em relação à infraestrutura tradicional on-premises?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Garantir controle físico sobre servidores e hardware da infraestrutura.",
        "because": "Incorreto: Na nuvem você não tem controle físico do hardware. A resposta correta é 'Trocar CapEx por OpEx variáveis', pois o benefício principal é a mudança no modelo financeiro.",
        "rep": false
      },
      {
        "alternative": "Trocar despesas de capital (CapEx) por operacionais (OpEx) variáveis.",
        "because": "Correto: Na nuvem, você não precisa investir antecipadamente em datacenters. Você paga apenas pelo que usa, convertendo custos fixos em variáveis.",
        "rep": true
      },
      {
        "alternative": "Manter equipe técnica dedicada para gerenciar hardware físico.",
        "because": "Incorreto: A nuvem justamente elimina essa necessidade, não a cria. A resposta correta é 'Trocar CapEx por OpEx variáveis'.",
        "rep": false
      },
      {
        "alternative": "Custos sempre menores que on-premises independente do padrão.",
        "because": "Incorreto: Os custos dependem do padrão de uso. A resposta correta é 'Trocar CapEx por OpEx variáveis', que é o benefício econômico real.",
        "rep": false
      }
    ]
  },
  {
    "id": 2,
    "title": "O que significa elasticidade na computação em nuvem AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Manter provisão estática de recursos independente da carga.",
        "because": "Incorreto: Isso é capacidade estática, oposto de elasticidade. A resposta correta é 'Aumentar ou diminuir recursos conforme demanda'.",
        "rep": false
      },
      {
        "alternative": "Capacidade de ajustar recursos automaticamente conforme demanda.",
        "because": "Correto: Elasticidade permite que sua infraestrutura cresça durante picos e diminua em baixo uso, otimizando custos e performance automaticamente.",
        "rep": true
      },
      {
        "alternative": "Replicar dados automaticamente em múltiplas regiões globais.",
        "because": "Incorreto: Isso descreve replicação geográfica. A resposta correta é 'Aumentar ou diminuir recursos conforme demanda'.",
        "rep": false
      },
      {
        "alternative": "Modelo de cobrança com valor fixo mensal sem variação.",
        "because": "Incorreto: Isso se refere ao modelo de precificação. A resposta correta é 'Aumentar ou diminuir recursos conforme demanda'.",
        "rep": false
      }
    ]
  },
  {
    "id": 3,
    "title": "Qual dos seguintes é um benefício da alta disponibilidade na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Concentrar componentes críticos em uma zona para melhor performance.",
        "because": "Incorreto: Concentrar em uma zona cria ponto único de falha. A resposta correta é 'Minimizar downtime distribuindo em múltiplas AZs'.",
        "rep": false
      },
      {
        "alternative": "Reduzir custos operacionais eliminando redundância de recursos.",
        "because": "Incorreto: Alta disponibilidade geralmente requer redundância. A resposta correta é 'Minimizar downtime distribuindo em múltiplas AZs'.",
        "rep": false
      },
      {
        "alternative": "Minimizar downtime distribuindo recursos em múltiplas AZs.",
        "because": "Correto: Alta disponibilidade é alcançada distribuindo aplicações em múltiplas Zonas de Disponibilidade, garantindo que falha de uma zona não afete toda aplicação.",
        "rep": true
      },
      {
        "alternative": "Substituir completamente estratégias de backup e recuperação.",
        "because": "Incorreto: Alta disponibilidade não substitui backups. A resposta correta é 'Minimizar downtime distribuindo em múltiplas AZs'.",
        "rep": false
      }
    ]
  },
  {
    "id": 4,
    "title": "Qual é a diferença entre uma Região AWS e uma Zona de Disponibilidade (AZ)?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Região contém múltiplas AZs; AZ é datacenter isolado fisicamente.",
        "because": "Correto: Uma Região AWS é área geográfica contendo múltiplas AZs. Cada AZ consiste em datacenters fisicamente separados com energia e rede redundantes.",
        "rep": true
      },
      {
        "alternative": "AZ é maior que Região e contém múltiplas regiões dentro.",
        "because": "Incorreto: A hierarquia está invertida. A resposta correta é 'Região contém múltiplas AZs; AZ é datacenter isolado fisicamente'.",
        "rep": false
      },
      {
        "alternative": "Regiões são para backup; AZs destinam-se à operação principal.",
        "because": "Incorreto: Ambas são usadas para operações. A resposta correta é 'Região contém múltiplas AZs; AZ é datacenter isolado fisicamente'.",
        "rep": false
      },
      {
        "alternative": "Região e AZ são termos sinônimos referindo-se ao mesmo conceito.",
        "because": "Incorreto: São conceitos diferentes em níveis geográficos distintos. A resposta correta é 'Região contém múltiplas AZs'.",
        "rep": false
      }
    ]
  },
  {
    "id": 5,
    "title": "O que caracteriza o modelo IaaS (Infrastructure as a Service)?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Fornece plataforma gerenciada para desenvolvimento sem acesso à infraestrutura.",
        "because": "Incorreto: Isso descreve PaaS. A resposta correta é 'Fornece infraestrutura virtualizada', pois IaaS dá mais controle sobre infraestrutura.",
        "rep": false
      },
      {
        "alternative": "Provedor gerencia completamente sistema operacional, aplicações e dados.",
        "because": "Incorreto: No IaaS, cliente gerencia SO, aplicações e dados. A resposta correta é 'Fornece infraestrutura virtualizada sob demanda'.",
        "rep": false
      },
      {
        "alternative": "Fornece infraestrutura virtualizada (servidores, storage, rede) sob demanda.",
        "because": "Correto: IaaS fornece recursos fundamentais de computação onde você gerencia SO, aplicações e dados, enquanto provedor gerencia virtualização e hardware.",
        "rep": true
      },
      {
        "alternative": "Disponibiliza aplicações completas prontas sem gerenciamento técnico.",
        "because": "Incorreto: Isso descreve SaaS. A resposta correta é 'Fornece infraestrutura virtualizada', pois IaaS requer que você gerencie SO e aplicações.",
        "rep": false
      }
    ]
  },
  {
    "id": 6,
    "title": "Qual conceito descreve 'agilidade' como benefício da nuvem AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Executar aplicações sempre da região geograficamente mais próxima.",
        "because": "Incorreto: Isso descreve alcance global ou latência. A resposta correta é 'Reduzir tempo de provisionamento para minutos'.",
        "rep": false
      },
      {
        "alternative": "Garantir disponibilidade contínua sem nenhum período de downtime.",
        "because": "Incorreto: Isso descreve alta disponibilidade. A resposta correta é 'Reduzir tempo de provisionamento de semanas para minutos'.",
        "rep": false
      },
      {
        "alternative": "Reduzir tempo de provisionamento de recursos de semanas para minutos.",
        "because": "Correto: Agilidade significa acesso rápido a recursos de TI sob demanda. O que levava semanas agora leva minutos, acelerando experimentação e inovação.",
        "rep": true
      },
      {
        "alternative": "Modelo de cobrança onde você paga apenas pelo que realmente utiliza.",
        "because": "Incorreto: Isso descreve pay-as-you-go. A resposta correta é 'Reduzir tempo de provisionamento', pois agilidade é sobre velocidade de acesso.",
        "rep": false
      }
    ]
  },
  {
    "id": 7,
    "title": "O que significa 'alcance global' (global reach) na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "AWS replica automaticamente todos dados em todas regiões disponíveis.",
        "because": "Incorreto: Replicação entre regiões deve ser configurada explicitamente. A resposta correta é 'Capacidade de implantar em múltiplas regiões'.",
        "rep": false
      },
      {
        "alternative": "Capacidade de implantar aplicações em múltiplas regiões geográficas.",
        "because": "Correto: AWS possui infraestrutura global com regiões em todos continentes, permitindo implantar próximo aos usuários finais, reduzindo latência e atendendo requisitos de residência.",
        "rep": true
      },
      {
        "alternative": "Requisito obrigatório de usar todas regiões para cada aplicação implantada.",
        "because": "Incorreto: Você escolhe quais regiões usar baseado em necessidades. A resposta correta é 'Capacidade de implantar em múltiplas regiões'.",
        "rep": false
      },
      {
        "alternative": "Garantia de que todos serviços estão disponíveis em todas regiões.",
        "because": "Incorreto: Alguns serviços têm disponibilidade regional limitada. A resposta correta é 'Implantar aplicações em múltiplas regiões globalmente'.",
        "rep": false
      }
    ]
  },
  {
    "id": 8,
    "title": "Qual é a principal característica do modelo de responsabilidade compartilhada da AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Cliente responsável pela segurança física dos datacenters AWS.",
        "because": "Incorreto: Segurança física é responsabilidade da AWS. A resposta correta é 'AWS pela segurança DA nuvem; cliente NA nuvem'.",
        "rep": false
      },
      {
        "alternative": "AWS pela segurança 'da' nuvem; cliente pela segurança 'na' nuvem.",
        "because": "Correto: AWS gerencia segurança da infraestrutura física, rede e virtualização. Cliente gerencia dados, aplicações, configurações, IAM e criptografia do conteúdo.",
        "rep": true
      },
      {
        "alternative": "Modelo onde ambas partes podem ignorar determinados aspectos de segurança.",
        "because": "Incorreto: Modelo define responsabilidades claras. A resposta correta é 'AWS pela segurança DA nuvem; cliente NA nuvem'.",
        "rep": false
      },
      {
        "alternative": "AWS responsável por toda segurança incluindo dados e aplicações do cliente.",
        "because": "Incorreto: Cliente sempre é responsável pelos próprios dados. A resposta correta é 'AWS pela segurança DA nuvem; cliente NA nuvem'.",
        "rep": false
      }
    ]
  },
  {
    "id": 9,
    "title": "Quando você deve considerar usar computação serverless na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Para executar código orientado a eventos sem gerenciar servidores.",
        "because": "Correto: Serverless (como Lambda) é ideal para código que responde a eventos, execuções curtas e intermitentes, onde você não quer gerenciar infraestrutura e paga apenas por execução.",
        "rep": true
      },
      {
        "alternative": "Para aplicações legadas monolíticas que não podem ser refatoradas.",
        "because": "Incorreto: Aplicações legadas geralmente requerem VMs tradicionais. A resposta correta é 'Executar código orientado a eventos sem gerenciar servidores'.",
        "rep": false
      },
      {
        "alternative": "Quando aplicação precisa executar 24/7 com requisitos de hardware específico.",
        "because": "Incorreto: Para workloads contínuos, EC2 pode ser mais econômico. A resposta correta é 'Executar código orientado a eventos sem gerenciar servidores'.",
        "rep": false
      },
      {
        "alternative": "Quando precisa de controle total sobre sistema operacional e configurações de rede.",
        "because": "Incorreto: Serverless abstrai infraestrutura e SO. A resposta correta é 'Executar código orientado a eventos sem gerenciar servidores'.",
        "rep": false
      }
    ]
  },
  {
    "id": 10,
    "title": "O que são edge locations na AWS?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Termo sinônimo para Regiões AWS onde clientes lançam instâncias EC2.",
        "because": "Incorreto: Edge locations são separadas de Regiões e não hospedam EC2. A resposta correta é 'Locais que armazenam cache próximo aos usuários'.",
        "rep": false
      },
      {
        "alternative": "Datacenters especializados destinados ao armazenamento de backups de longo prazo.",
        "because": "Incorreto: Backups são armazenados em Regiões (S3, Glacier). A resposta correta é 'Locais que armazenam cache de conteúdo próximo aos usuários'.",
        "rep": false
      },
      {
        "alternative": "Locais que armazenam cache de conteúdo mais próximo aos usuários finais.",
        "because": "Correto: Edge locations fazem parte da CDN do CloudFront. São datacenters que armazenam cache de conteúdo popular próximo aos usuários, reduzindo latência.",
        "rep": true
      },
      {
        "alternative": "Locais físicos acessíveis exclusivamente para clientes plano Enterprise Support.",
        "because": "Incorreto: Edge locations são usadas automaticamente por CloudFront para todos. A resposta correta é 'Locais que armazenam cache próximo aos usuários'.",
        "rep": false
      }
    ]
  },
  {
    "id": 11,
    "title": "Qual princípio de segurança da AWS recomenda conceder apenas permissões necessárias?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Princípio de compartilhamento colaborativo de credenciais entre equipes técnicas.",
        "because": "Incorreto: Compartilhar credenciais é má prática de segurança. A resposta correta é 'Princípio do menor privilégio (Least Privilege)'.",
        "rep": false
      },
      {
        "alternative": "Princípio do menor privilégio (Least Privilege).",
        "because": "Correto: O princípio do menor privilégio significa conceder aos usuários apenas permissões mínimas necessárias, reduzindo risco de ações acidentais ou maliciosas.",
        "rep": true
      },
      {
        "alternative": "Princípio de conceder acesso administrativo completo por padrão para facilitar.",
        "because": "Incorreto: Acesso total por padrão viola princípios de segurança. A resposta correta é 'Princípio do menor privilégio (Least Privilege)'.",
        "rep": false
      },
      {
        "alternative": "Princípio de minimizar processos de auditoria e logging para agilizar o desenvolvimento.",
        "because": "Incorreto: Auditoria é essencial para segurança. A resposta correta é 'Princípio do menor privilégio', que trata de limitar permissões.",
        "rep": false
      }
    ]
  },
  {
    "id": 12,
    "title": "O que é AWS IAM (Identity and Access Management)?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Ferramenta especializada para criação de relatórios detalhados de custos e billing.",
        "because": "Incorreto: Relatórios de custo são do Cost Explorer. A resposta correta é 'Serviço para gerenciar usuários e controlar acesso aos recursos AWS'.",
        "rep": false
      },
      {
        "alternative": "Sistema de monitoramento em tempo real de performance e disponibilidade de aplicações.",
        "because": "Incorreto: Monitoramento é função do CloudWatch. A resposta correta é 'Serviço para gerenciar usuários e controlar acesso aos recursos AWS'.",
        "rep": false
      },
      {
        "alternative": "Serviço para gerenciar usuários e controlar acesso aos recursos AWS de forma segura.",
        "because": "Correto: IAM permite criar e gerenciar usuários, grupos, roles e policies para controlar quem acessa quais recursos. É fundamental para segurança e é gratuito.",
        "rep": true
      },
      {
        "alternative": "Serviço dedicado ao armazenamento de backups criptografados e arquivos de dados sensíveis.",
        "because": "Incorreto: Backup é função de S3/Glacier com criptografia. A resposta correta é 'Serviço para gerenciar usuários e controlar acesso aos recursos AWS'.",
        "rep": false
      }
    ]
  },
  {
    "id": 13,
    "title": "Por que habilitar autenticação multifator (MFA) é uma boa prática na AWS?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Adiciona camada extra de proteção exigindo senha e código de segundo fator adicional.",
        "because": "Correto: MFA protege contra acesso não autorizado mesmo se senha for comprometida, exigindo segundo fator. É especialmente importante para root e usuários administrativos.",
        "rep": true
      },
      {
        "alternative": "Elimina completamente necessidade de implementar políticas IAM e permissões granulares.",
        "because": "Incorreto: MFA trata de autenticação; políticas IAM tratam de autorização. A resposta correta é 'Adiciona camada extra de proteção exigindo senha e segundo fator'.",
        "rep": false
      },
      {
        "alternative": "Permite de forma segura que múltiplos usuários compartilhem credenciais da mesma conta.",
        "because": "Incorreto: Compartilhar contas é má prática mesmo com MFA. A resposta correta é 'Adiciona camada extra de proteção exigindo senha e segundo fator'.",
        "rep": false
      },
      {
        "alternative": "Substitui completamente a necessidade de criar e utilizar senhas fortes e complexas.",
        "because": "Incorreto: MFA complementa senhas fortes, não as substitui. A resposta correta é 'Adiciona camada extra de proteção exigindo senha e segundo fator'.",
        "rep": false
      }
    ]
  },
  {
    "id": 14,
    "title": "Qual serviço AWS ajuda a proteger aplicações web contra ataques comuns como SQL injection?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon S3 com políticas de bucket configuradas.",
        "because": "Incorreto: S3 é serviço de armazenamento de objetos. A resposta correta é 'AWS WAF (Web Application Firewall)'.",
        "rep": false
      },
      {
        "alternative": "AWS IAM com policies restritivas.",
        "because": "Incorreto: IAM gerencia identidades e acessos, não filtra tráfego web. A resposta correta é 'AWS WAF (Web Application Firewall)'.",
        "rep": false
      },
      {
        "alternative": "AWS WAF (Web Application Firewall).",
        "because": "Correto: AWS WAF protege aplicações web filtrando tráfego HTTP/HTTPS malicioso. Permite criar regras contra SQL injection, XSS e integra com CloudFront e ALB.",
        "rep": true
      },
      {
        "alternative": "Amazon VPC com Security Groups.",
        "because": "Incorreto: VPC fornece isolamento de rede, mas não proteção de aplicação web. A resposta correta é 'AWS WAF (Web Application Firewall)'.",
        "rep": false
      }
    ]
  },
  {
    "id": 15,
    "title": "Qual serviço AWS permite centralizar e automatizar conformidade de configurações de recursos?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon CloudWatch para métricas.",
        "because": "Incorreto: CloudWatch monitora performance e métricas, não conformidade de configurações. A resposta correta é 'AWS Config'.",
        "rep": false
      },
      {
        "alternative": "AWS Config.",
        "because": "Correto: AWS Config avalia, audita e monitora configurações de recursos AWS continuamente. Permite verificar conformidade com padrões internos e rastrear mudanças ao longo do tempo.",
        "rep": true
      },
      {
        "alternative": "AWS Lambda com automações.",
        "because": "Incorreto: Lambda executa código serverless, não audita configurações. A resposta correta é 'AWS Config'.",
        "rep": false
      },
      {
        "alternative": "Amazon Inspector para vulnerabilidades.",
        "because": "Incorreto: Inspector avalia vulnerabilidades de segurança em aplicações, não configurações. A resposta correta é 'AWS Config'.",
        "rep": false
      }
    ]
  },
  {
    "id": 16,
    "title": "O que significa criptografia 'em repouso' (at rest)?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Criptografar dados armazenados em discos, databases ou sistemas de armazenamento persistente.",
        "because": "Correto: Criptografia em repouso protege dados quando armazenados (não transmitidos), como em volumes EBS, buckets S3, bancos RDS. Impede acesso não autorizado aos discos.",
        "rep": true
      },
      {
        "alternative": "Criptografar dados durante processo de transmissão e transferência pela rede entre sistemas.",
        "because": "Incorreto: Isso é criptografia em trânsito (in transit). A resposta correta é 'Criptografar dados armazenados em discos, databases ou sistemas de armazenamento'.",
        "rep": false
      },
      {
        "alternative": "Substituir e eliminar necessidade de controles de acesso baseados em permissões IAM.",
        "because": "Incorreto: Criptografia complementa controles de acesso, não os substitui. A resposta correta é 'Criptografar dados armazenados em discos ou databases'.",
        "rep": false
      },
      {
        "alternative": "Criptografar exclusivamente metadados de arquivos mantendo conteúdo real em texto plano.",
        "because": "Incorreto: Criptografia em repouso protege o conteúdo completo. A resposta correta é 'Criptografar dados armazenados em discos, databases ou sistemas de armazenamento'.",
        "rep": false
      }
    ]
  },
  {
    "id": 17,
    "title": "Qual serviço AWS fornece relatórios de conformidade como SOC, PCI e ISO?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "AWS CloudTrail para logs.",
        "because": "Incorreto: CloudTrail registra chamadas de API, não fornece relatórios de conformidade. A resposta correta é 'AWS Artifact'.",
        "rep": false
      },
      {
        "alternative": "Amazon Inspector para avaliações.",
        "because": "Incorreto: Inspector avalia vulnerabilidades de aplicações. A resposta correta é 'AWS Artifact'.",
        "rep": false
      },
      {
        "alternative": "AWS Artifact.",
        "because": "Correto: AWS Artifact é portal de autoatendimento para acessar relatórios de conformidade e certificações da AWS (SOC, PCI DSS, ISO) e acordos como BAA sob demanda sem custo.",
        "rep": true
      },
      {
        "alternative": "AWS Systems Manager para governança.",
        "because": "Incorreto: Systems Manager gerencia e automatiza tarefas operacionais. A resposta correta é 'AWS Artifact'.",
        "rep": false
      }
    ]
  },
  {
    "id": 18,
    "title": "Para que serve o AWS CloudTrail?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Registrar e monitorar todas ações de API realizadas na conta AWS para auditoria e conformidade.",
        "because": "Correto: CloudTrail fornece histórico de eventos da conta AWS, registrando quem fez o quê, quando e de onde. Essencial para auditoria de segurança e análise forense.",
        "rep": true
      },
      {
        "alternative": "Distribuir conteúdo de aplicações globalmente através de rede de CDN.",
        "because": "Incorreto: CDN é função do CloudFront. A resposta correta é 'Registrar e monitorar todas ações de API realizadas na conta AWS'.",
        "rep": false
      },
      {
        "alternative": "Bloquear automaticamente usuários com comportamento suspeito ou malicioso identificado.",
        "because": "Incorreto: CloudTrail registra eventos, não bloqueia acesso. A resposta correta é 'Registrar e monitorar todas ações de API realizadas na conta AWS'.",
        "rep": false
      },
      {
        "alternative": "Executar backups automáticos programados de instâncias EC2 e volumes EBS.",
        "because": "Incorreto: Backups são feitos com snapshots EBS ou AWS Backup. A resposta correta é 'Registrar e monitorar todas ações de API realizadas na conta AWS'.",
        "rep": false
      }
    ]
  },
  {
    "id": 19,
    "title": "Qual recurso AWS ajuda a proteger a conta root?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": true,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Criar usuários IAM com privilégios apropriados para tarefas administrativas rotineiras.",
        "because": "Correto: Em vez de usar conta root, crie usuários IAM com permissões necessárias para tarefas diárias, mantendo a conta root para uso extremamente limitado.",
        "rep": true
      },
      {
        "alternative": "Utilizar a conta root exclusivamente para todas as tarefas diárias de administração do ambiente.",
        "because": "Incorreto: Deve-se evitar usar conta root rotineiramente. A resposta correta é 'Habilitar MFA na conta root' e 'Criar usuários IAM com privilégios apropriados'.",
        "rep": false
      },
      {
        "alternative": "Habilitar MFA (autenticação multifator) na conta root para adicionar camada extra de segurança.",
        "because": "Correto: MFA na conta root adiciona camada crítica de segurança. Como root tem acesso irrestrito, protegê-la com MFA é uma das melhores práticas mais importantes.",
        "rep": true
      },
      {
        "alternative": "Compartilhar credenciais da conta root com todos os membros da equipe técnica.",
        "because": "Incorreto: Nunca compartilhe credenciais root. A resposta correta é 'Habilitar MFA na conta root' e 'Criar usuários IAM individuais para equipe'.",
        "rep": false
      }
    ]
  },
  {
    "id": 20,
    "title": "O que é AWS Shield?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Sistema de detecção de intrusão para análise de tráfego em instâncias EC2.",
        "because": "Incorreto: Detecção de intrusão em instâncias seria GuardDuty ou Inspector. A resposta correta é 'Serviço de proteção gerenciada contra ataques DDoS'.",
        "rep": false
      },
      {
        "alternative": "Serviço de proteção gerenciada contra ataques DDoS (Distributed Denial of Service).",
        "because": "Correto: AWS Shield protege aplicações contra ataques DDoS. Shield Standard é gratuito e automático. Shield Advanced oferece proteção adicional e resposta 24/7.",
        "rep": true
      },
      {
        "alternative": "Firewall de aplicação web especializado em bloquear ataques de SQL injection e XSS.",
        "because": "Incorreto: Isso é função do AWS WAF. A resposta correta é 'Serviço de proteção gerenciada contra ataques DDoS (Distributed Denial of Service)'.",
        "rep": false
      },
      {
        "alternative": "Serviço de backup automatizado e recuperação de desastres para continuidade de negócios.",
        "because": "Incorreto: Backup é função de S3/Glacier e AWS Backup. A resposta correta é 'Serviço de proteção gerenciada contra ataques DDoS'.",
        "rep": false
      }
    ]
  },
  {
    "id": 21,
    "title": "Qual serviço AWS você usaria para executar máquinas virtuais na nuvem?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Amazon S3 para armazenamento.",
        "because": "Incorreto: S3 é para armazenamento de objetos, não execução de VMs. A resposta correta é 'Amazon EC2 (Elastic Compute Cloud)'.",
        "rep": false
      },
      {
        "alternative": "AWS Lambda para funções.",
        "because": "Incorreto: Lambda é serverless, você não gerencia VMs. A resposta correta é 'Amazon EC2 (Elastic Compute Cloud)'.",
        "rep": false
      },
      {
        "alternative": "Amazon EC2 (Elastic Compute Cloud).",
        "because": "Correto: EC2 fornece capacidade de computação redimensionável através de servidores virtuais. Você escolhe tipo de instância, SO, armazenamento e rede, tendo controle total sobre VM.",
        "rep": true
      },
      {
        "alternative": "Amazon RDS para databases.",
        "because": "Incorreto: RDS é serviço gerenciado de banco de dados. A resposta correta é 'Amazon EC2 (Elastic Compute Cloud)'.",
        "rep": false
      }
    ]
  },
  {
    "id": 22,
    "title": "Qual serviço AWS é recomendado para armazenar arquivos estáticos de um website?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Amazon EC2 com servidor web.",
        "because": "Incorreto: EC2 pode servir arquivos, mas S3 é mais econômico e apropriado. A resposta correta é 'Amazon S3'.",
        "rep": false
      },
      {
        "alternative": "Amazon S3.",
        "because": "Correto: S3 é ideal para hospedar arquivos estáticos (HTML, CSS, JavaScript, imagens) com alta durabilidade, disponibilidade e custo-benefício. Pode hospedar websites estáticos completos.",
        "rep": true
      },
      {
        "alternative": "AWS Lambda para processamento.",
        "because": "Incorreto: Lambda executa código, não armazena arquivos estáticos. A resposta correta é 'Amazon S3'.",
        "rep": false
      },
      {
        "alternative": "Amazon RDS para dados.",
        "because": "Incorreto: RDS é para bancos de dados relacionais, não arquivos estáticos. A resposta correta é 'Amazon S3'.",
        "rep": false
      }
    ]
  },
  {
    "id": 23,
    "title": "Qual serviço AWS fornece banco de dados relacional gerenciado?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Amazon S3 para objetos.",
        "because": "Incorreto: S3 é armazenamento de objetos, não banco de dados. A resposta correta é 'Amazon RDS (Relational Database Service)'.",
        "rep": false
      },
      {
        "alternative": "Amazon RDS (Relational Database Service).",
        "because": "Correto: RDS facilita configurar, operar e escalar bancos relacionais (MySQL, PostgreSQL, Oracle, SQL Server, MariaDB, Aurora). AWS gerencia backups, patching e replicação automaticamente.",
        "rep": true
      },
      {
        "alternative": "Amazon Redshift para analytics.",
        "because": "Incorreto: Redshift é data warehouse para analytics, não DB transacional. A resposta correta é 'Amazon RDS (Relational Database Service)'.",
        "rep": false
      },
      {
        "alternative": "Amazon DynamoDB para NoSQL.",
        "because": "Incorreto: DynamoDB é banco NoSQL, não relacional. A resposta correta é 'Amazon RDS (Relational Database Service)'.",
        "rep": false
      }
    ]
  },
  {
    "id": 24,
    "title": "Para que serve o AWS Lambda?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Gerenciar políticas de permissões e acesso.",
        "because": "Incorreto: Isso é função do IAM. A resposta correta é 'Executar código sem provisionar ou gerenciar servidores'.",
        "rep": false
      },
      {
        "alternative": "Executar código sob demanda sem provisionar ou gerenciar servidores.",
        "because": "Correto: Lambda é serviço serverless que executa código em resposta a eventos (uploads S3, mudanças DynamoDB, requisições HTTP). Você paga apenas pelo tempo de computação consumido.",
        "rep": true
      },
      {
        "alternative": "Criar redes virtuais isoladas e privadas.",
        "because": "Incorreto: Isso é função do VPC. A resposta correta é 'Executar código sob demanda sem provisionar ou gerenciar servidores'.",
        "rep": false
      },
      {
        "alternative": "Armazenar grandes volumes de dados estruturados.",
        "because": "Incorreto: Armazenamento é função de S3 ou databases. A resposta correta é 'Executar código sob demanda sem provisionar ou gerenciar servidores'.",
        "rep": false
      }
    ]
  },
  {
    "id": 25,
    "title": "Qual serviço AWS distribui conteúdo para usuários globalmente com baixa latência?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon VPC para redes.",
        "because": "Incorreto: VPC cria redes virtuais, não distribui conteúdo. A resposta correta é 'Amazon CloudFront'.",
        "rep": false
      },
      {
        "alternative": "Amazon CloudFront.",
        "because": "Correto: CloudFront é serviço de CDN que distribui conteúdo através de rede global de edge locations, reduzindo latência ao entregar do local mais próximo ao usuário.",
        "rep": true
      },
      {
        "alternative": "Amazon S3 para storage.",
        "because": "Incorreto: S3 armazena objetos mas não é CDN otimizado. A resposta correta é 'Amazon CloudFront'.",
        "rep": false
      },
      {
        "alternative": "AWS Direct Connect para conexão.",
        "because": "Incorreto: Direct Connect é conexão dedicada entre on-premises e AWS. A resposta correta é 'Amazon CloudFront'.",
        "rep": false
      }
    ]
  },
  {
    "id": 26,
    "title": "O que é Amazon VPC?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Sistema de arquivos compartilhado e escalável.",
        "because": "Incorreto: Isso é EFS. A resposta correta é 'Rede virtual logicamente isolada onde você pode lançar recursos AWS'.",
        "rep": false
      },
      {
        "alternative": "Rede virtual logicamente isolada onde você pode lançar recursos AWS com controle completo.",
        "because": "Correto: VPC permite criar rede virtual com controle completo sobre ambiente, incluindo seleção de IPs, criação de subnets, configuração de tabelas de roteamento e gateways.",
        "rep": true
      },
      {
        "alternative": "Ferramenta de monitoramento de métricas e logs.",
        "because": "Incorreto: Isso é CloudWatch. A resposta correta é 'Rede virtual logicamente isolada onde você pode lançar recursos AWS'.",
        "rep": false
      },
      {
        "alternative": "Serviço de banco de dados NoSQL gerenciado.",
        "because": "Incorreto: Isso é DynamoDB. A resposta correta é 'Rede virtual logicamente isolada onde você pode lançar recursos AWS'.",
        "rep": false
      }
    ]
  },
  {
    "id": 27,
    "title": "Qual serviço AWS ajuda a distribuir tráfego entre múltiplas instâncias EC2?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon Route 53 para DNS.",
        "because": "Incorreto: Route 53 é DNS, pode rotear mas não é load balancer. A resposta correta é 'Elastic Load Balancing (ELB)'.",
        "rep": false
      },
      {
        "alternative": "AWS Auto Scaling para capacidade.",
        "because": "Incorreto: Auto Scaling adiciona/remove instâncias, mas ELB distribui tráfego. A resposta correta é 'Elastic Load Balancing (ELB)'.",
        "rep": false
      },
      {
        "alternative": "Elastic Load Balancing (ELB).",
        "because": "Correto: ELB distribui automaticamente tráfego de entrada entre múltiplos destinos (EC2, containers, IPs) em uma ou mais AZs, aumentando disponibilidade da aplicação.",
        "rep": true
      },
      {
        "alternative": "Amazon CloudFront para CDN.",
        "because": "Incorreto: CloudFront é CDN para conteúdo, não balanceador. A resposta correta é 'Elastic Load Balancing (ELB)'.",
        "rep": false
      }
    ]
  },
  {
    "id": 28,
    "title": "O que o Amazon DynamoDB fornece?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Data warehouse para análise de petabytes.",
        "because": "Incorreto: Isso é Redshift. A resposta correta é 'Banco NoSQL totalmente gerenciado com performance consistente de milissegundos'.",
        "rep": false
      },
      {
        "alternative": "Banco NoSQL totalmente gerenciado com performance consistente de milissegundos.",
        "because": "Correto: DynamoDB é banco chave-valor e documento totalmente gerenciado, serverless, com escalabilidade automática e performance consistente. Ideal para mobile, web, gaming, IoT.",
        "rep": true
      },
      {
        "alternative": "Banco relacional com suporte completo a SQL.",
        "because": "Incorreto: Isso é RDS/Aurora. A resposta correta é 'Banco NoSQL totalmente gerenciado com performance consistente de milissegundos'.",
        "rep": false
      },
      {
        "alternative": "Cache em memória como Redis ou Memcached.",
        "because": "Incorreto: Isso é ElastiCache. A resposta correta é 'Banco NoSQL totalmente gerenciado com performance consistente de milissegundos'.",
        "rep": false
      }
    ]
  },
  {
    "id": 29,
    "title": "Para que serve o AWS Auto Scaling?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Fazer backup automático de dados em múltiplas regiões.",
        "because": "Incorreto: Backup é função de AWS Backup. A resposta correta é 'Ajustar automaticamente capacidade de recursos para manter performance ao menor custo'.",
        "rep": false
      },
      {
        "alternative": "Ajustar automaticamente capacidade de recursos para manter performance ao menor custo.",
        "because": "Correto: Auto Scaling monitora aplicações e ajusta capacidade (EC2, ECS tasks, DynamoDB throughput) baseado em condições definidas, mantendo disponibilidade e otimizando custos.",
        "rep": true
      },
      {
        "alternative": "Distribuir tráfego uniformemente entre servidores.",
        "because": "Incorreto: Isso é função do Load Balancer. A resposta correta é 'Ajustar automaticamente capacidade de recursos para manter performance ao menor custo'.",
        "rep": false
      },
      {
        "alternative": "Monitorar performance e gerar alertas operacionais.",
        "because": "Incorreto: Monitoramento é função do CloudWatch. A resposta correta é 'Ajustar automaticamente capacidade de recursos para manter performance ao menor custo'.",
        "rep": false
      }
    ]
  },
  {
    "id": 30,
    "title": "Qual serviço AWS fornece sistema de arquivos compartilhado escalável?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Amazon S3 para objetos.",
        "because": "Incorreto: S3 é object storage acessado via API, não sistema de arquivos. A resposta correta é 'Amazon EFS (Elastic File System)'.",
        "rep": false
      },
      {
        "alternative": "Amazon EFS (Elastic File System).",
        "because": "Correto: EFS fornece sistema de arquivos NFS elástico totalmente gerenciado que pode ser montado por múltiplas instâncias EC2 simultaneamente, escalando automaticamente.",
        "rep": true
      },
      {
        "alternative": "Amazon EBS (Elastic Block Store).",
        "because": "Incorreto: EBS fornece volumes de bloco anexados a uma única instância. A resposta correta é 'Amazon EFS (Elastic File System)'.",
        "rep": false
      },
      {
        "alternative": "Amazon Glacier para arquivamento.",
        "because": "Incorreto: Glacier é para arquivamento de longo prazo. A resposta correta é 'Amazon EFS (Elastic File System)'.",
        "rep": false
      }
    ]
  },
  {
    "id": 31,
    "title": "Como funciona o modelo de precificação 'pay-as-you-go' da AWS?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Você paga apenas pelos recursos consumidos sem contratos de longo prazo ou custos iniciais.",
        "because": "Correto: Pay-as-you-go significa cobrança baseada em uso real (horas de computação, GB armazenados) sem compromisso antecipado. Você aumenta ou diminui uso conforme necessário.",
        "rep": true
      },
      {
        "alternative": "Você deve pagar antecipadamente por toda capacidade planejada para o ano fiscal.",
        "because": "Incorreto: Isso seria modelo de reserva antecipada. A resposta correta é 'Você paga apenas pelos recursos consumidos sem contratos de longo prazo'.",
        "rep": false
      },
      {
        "alternative": "Você paga taxa mensal fixa independente do volume de uso dos serviços.",
        "because": "Incorreto: Isso seria precificação flat/fixa. A resposta correta é 'Você paga apenas pelos recursos consumidos sem contratos de longo prazo'.",
        "rep": false
      },
      {
        "alternative": "Você precisa assinar contrato de 3 anos para acessar os serviços AWS.",
        "because": "Incorreto: Contratos são opcionais (RIs) para desconto. A resposta correta é 'Você paga apenas pelos recursos consumidos sem contratos de longo prazo'.",
        "rep": false
      }
    ]
  },
  {
    "id": 32,
    "title": "O que são Reserved Instances (RIs) no EC2?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Instâncias gratuitas disponíveis no Free Tier para novos clientes.",
        "because": "Incorreto: Free Tier é separado de RIs. A resposta correta é 'Compromisso de 1 ou 3 anos que fornece desconto significativo comparado a On-Demand'.",
        "rep": false
      },
      {
        "alternative": "Cobram exatamente o mesmo preço que instâncias On-Demand padrão.",
        "because": "Incorreto: RIs oferecem desconto substancial. A resposta correta é 'Compromisso de 1 ou 3 anos que fornece desconto significativo comparado a On-Demand'.",
        "rep": false
      },
      {
        "alternative": "Compromisso de 1 ou 3 anos que fornece desconto significativo comparado a On-Demand.",
        "because": "Correto: RIs oferecem até 75% de desconto sobre preço On-Demand em troca de compromisso de termo. Ideal para workloads com uso previsível e contínuo.",
        "rep": true
      },
      {
        "alternative": "Instâncias que podem ser interrompidas pela AWS quando capacidade é necessária.",
        "because": "Incorreto: Isso descreve Spot Instances. A resposta correta é 'Compromisso de 1 ou 3 anos que fornece desconto significativo comparado a On-Demand'.",
        "rep": false
      }
    ]
  },
  {
    "id": 33,
    "title": "Qual ferramenta AWS ajuda a visualizar e analisar seus custos?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "AWS Config para conformidade.",
        "because": "Incorreto: Config audita configurações de recursos, não custos. A resposta correta é 'AWS Cost Explorer'.",
        "rep": false
      },
      {
        "alternative": "AWS Cost Explorer.",
        "because": "Correto: Cost Explorer fornece interface para visualizar, entender e gerenciar custos e uso da AWS. Permite criar relatórios customizados, identificar tendências e prever gastos futuros.",
        "rep": true
      },
      {
        "alternative": "Amazon CloudWatch para métricas.",
        "because": "Incorreto: CloudWatch monitora performance/métricas técnicas, não custos. A resposta correta é 'AWS Cost Explorer'.",
        "rep": false
      },
      {
        "alternative": "AWS CloudTrail para auditoria.",
        "because": "Incorreto: CloudTrail registra atividades de API, não analisa custos. A resposta correta é 'AWS Cost Explorer'.",
        "rep": false
      }
    ]
  },
  {
    "id": 34,
    "title": "Para que serve o AWS Budgets?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Processar pagamentos de faturas AWS automaticamente.",
        "because": "Incorreto: Processamento de pagamento é feito pelo billing. A resposta correta é 'Definir orçamentos customizados e receber alertas quando custos ou uso excederem limites'.",
        "rep": false
      },
      {
        "alternative": "Definir orçamentos customizados e receber alertas quando custos ou uso excederem limites.",
        "because": "Correto: AWS Budgets permite criar orçamentos para custos, uso, RIs/Savings Plans e receber notificações quando valores reais ou previstos excederem thresholds definidos.",
        "rep": true
      },
      {
        "alternative": "Aplicar descontos automáticos em todos os serviços utilizados.",
        "because": "Incorreto: Budgets não aplica descontos. A resposta correta é 'Definir orçamentos customizados e receber alertas quando custos ou uso excederem limites'.",
        "rep": false
      },
      {
        "alternative": "Automaticamente desligar recursos quando orçamento for excedido.",
        "because": "Incorreto: Budgets alerta mas não desliga recursos automaticamente. A resposta correta é 'Definir orçamentos customizados e receber alertas quando custos ou uso excederem limites'.",
        "rep": false
      }
    ]
  },
  {
    "id": 35,
    "title": "Quais são os planos de AWS Support disponíveis?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Apenas um plano gratuito para todos sem diferenciação.",
        "because": "Incorreto: Há múltiplos planos com recursos diferentes. A resposta correta é 'Basic, Developer, Business e Enterprise'.",
        "rep": false
      },
      {
        "alternative": "Basic, Developer, Business e Enterprise.",
        "because": "Correto: AWS oferece 4 níveis: Basic (gratuito), Developer (email), Business (suporte 24/7, telefone, Trusted Advisor completo) e Enterprise (TAM dedicado, resposta em 15min).",
        "rep": true
      },
      {
        "alternative": "Todos os planos são pagos sem opção gratuita disponível.",
        "because": "Incorreto: Basic é gratuito para todos. A resposta correta é 'Basic, Developer, Business e Enterprise'.",
        "rep": false
      },
      {
        "alternative": "Standard e Premium apenas.",
        "because": "Incorreto: Esses não são os nomes dos planos AWS. A resposta correta é 'Basic, Developer, Business e Enterprise'.",
        "rep": false
      }
    ]
  },
  {
    "id": 36,
    "title": "O que o AWS Trusted Advisor faz?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Gerencia permissões de usuários e roles IAM automaticamente.",
        "because": "Incorreto: Gerenciamento de permissões é IAM. A resposta correta é 'Fornece recomendações automatizadas de melhores práticas em custo, performance, segurança e resiliência'.",
        "rep": false
      },
      {
        "alternative": "Fornece recomendações automatizadas de melhores práticas em custo, performance, segurança e resiliência.",
        "because": "Correto: Trusted Advisor verifica seu ambiente e sugere otimizações em 5 pilares: cost optimization, performance, security, fault tolerance e service limits.",
        "rep": true
      },
      {
        "alternative": "Monitora métricas de aplicação em tempo real continuamente.",
        "because": "Incorreto: Monitoramento em tempo real é CloudWatch. A resposta correta é 'Fornece recomendações automatizadas de melhores práticas em custo, performance, segurança e resiliência'.",
        "rep": false
      },
      {
        "alternative": "Executa backups automáticos de todos os recursos AWS provisionados.",
        "because": "Incorreto: Backup é função de AWS Backup. A resposta correta é 'Fornece recomendações automatizadas de melhores práticas em custo, performance, segurança e resiliência'.",
        "rep": false
      }
    ]
  },
  {
    "id": 37,
    "title": "Como tags de alocação de custos ajudam no gerenciamento de billing?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Automaticamente reduzem custos em 30% quando aplicadas aos recursos.",
        "because": "Incorreto: Tags organizam custos, não reduzem automaticamente. A resposta correta é 'Permitem categorizar e rastrear custos por projeto, departamento ou ambiente'.",
        "rep": false
      },
      {
        "alternative": "Permitem categorizar e rastrear custos por projeto, departamento ou ambiente específico.",
        "because": "Correto: Tags são pares chave-valor aplicados a recursos que aparecem em relatórios de custo, permitindo alocar gastos por unidade de negócio, centro de custo ou projeto.",
        "rep": true
      },
      {
        "alternative": "Impedem que recursos sejam deletados acidentalmente pela equipe.",
        "because": "Incorreto: Proteção contra deleção usa outros mecanismos. A resposta correta é 'Permitem categorizar e rastrear custos por projeto, departamento ou ambiente'.",
        "rep": false
      },
      {
        "alternative": "São obrigatórias para usar qualquer serviço AWS na conta.",
        "because": "Incorreto: Tags são opcionais (mas recomendadas). A resposta correta é 'Permitem categorizar e rastrear custos por projeto, departamento ou ambiente'.",
        "rep": false
      }
    ]
  },
  {
    "id": 38,
    "title": "O que são Spot Instances?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Custam exatamente o mesmo que instâncias On-Demand padrão.",
        "because": "Incorreto: Spot oferece descontos substanciais. A resposta correta é 'Instâncias EC2 com desconto de até 90% que podem ser interrompidas pela AWS'.",
        "rep": false
      },
      {
        "alternative": "Instâncias EC2 com desconto de até 90% que podem ser interrompidas pela AWS quando capacidade é necessária.",
        "because": "Correto: Spot Instances aproveitam capacidade ociosa da AWS com grandes descontos. AWS pode interromper com 2 minutos de aviso. Ideal para batch processing, análise de dados e testes.",
        "rep": true
      },
      {
        "alternative": "São ideais para bancos de dados de produção com requisitos críticos de disponibilidade.",
        "because": "Incorreto: Workloads críticos precisam de disponibilidade garantida. A resposta correta é 'Instâncias EC2 com desconto de até 90% que podem ser interrompidas pela AWS'.",
        "rep": false
      },
      {
        "alternative": "Garantem disponibilidade contínua com desconto de longo prazo mediante compromisso.",
        "because": "Incorreto: Isso descreve Reserved Instances. A resposta correta é 'Instâncias EC2 com desconto de até 90% que podem ser interrompidas pela AWS'.",
        "rep": false
      }
    ]
  },
  {
    "id": 39,
    "title": "O que o AWS Free Tier oferece?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Disponível apenas para organizações educacionais e instituições sem fins lucrativos.",
        "because": "Incorreto: Free Tier está disponível para todos os novos clientes. A resposta correta é 'Uso gratuito de serviços por 12 meses, além de ofertas sempre gratuitas e trials'.",
        "rep": false
      },
      {
        "alternative": "Uso gratuito de serviços por 12 meses, além de ofertas sempre gratuitas e trials.",
        "because": "Correto: Free Tier inclui: 12 meses de uso gratuito após signup (750h EC2, 5GB S3), sempre gratuito para certos serviços (1M Lambda requests/mês) e trials curtos de novos serviços.",
        "rep": true
      },
      {
        "alternative": "Todos os serviços AWS completamente gratuitos sem nenhum tipo de limite de uso.",
        "because": "Incorreto: Free Tier tem limites específicos por serviço. A resposta correta é 'Uso gratuito de serviços por 12 meses, além de ofertas sempre gratuitas e trials'.",
        "rep": false
      },
      {
        "alternative": "Requer pagamento antecipado para ativar os benefícios do programa.",
        "because": "Incorreto: Free Tier não requer pagamento (apenas validação de cartão). A resposta correta é 'Uso gratuito de serviços por 12 meses, além de ofertas sempre gratuitas e trials'.",
        "rep": false
      }
    ]
  },
  {
    "id": 40,
    "title": "Qual é o benefício do AWS Savings Plans?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Aplicável somente a serviços de armazenamento como S3 e Glacier.",
        "because": "Incorreto: Savings Plans são para compute (EC2, Lambda, Fargate). A resposta correta é 'Compromisso de gasto por hora que oferece desconto e flexibilidade entre tipos de instância e regiões'.",
        "rep": false
      },
      {
        "alternative": "Compromisso de gasto por hora que oferece desconto e flexibilidade entre tipos de instância e regiões.",
        "because": "Correto: Savings Plans oferecem até 72% de desconto em troca de compromisso de gasto por 1 ou 3 anos. Mais flexível que RIs, permitindo mudança de tipo, região e até serviços (EC2, Lambda, Fargate).",
        "rep": true
      },
      {
        "alternative": "Sempre mais caro que modelo pay-as-you-go padrão sem benefícios adicionais.",
        "because": "Incorreto: Savings Plans oferecem descontos significativos. A resposta correta é 'Compromisso de gasto por hora que oferece desconto e flexibilidade entre tipos de instância e regiões'.",
        "rep": false
      },
      {
        "alternative": "Não requer nenhum compromisso de uso ou gasto contínuo.",
        "because": "Incorreto: Savings Plans requerem compromisso de gasto. A resposta correta é 'Compromisso de gasto por hora que oferece desconto e flexibilidade entre tipos de instância e regiões'.",
        "rep": false
      }
    ]
  },
  {
    "id": 41,
    "title": "O que significa 'escalabilidade' na computação em nuvem?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Capacidade de adicionar recursos para lidar com aumento de carga de trabalho.",
        "because": "Correto: Escalabilidade é a capacidade de aumentar recursos (vertical ou horizontal) para atender crescimento de demanda. Vertical adiciona poder a um servidor; horizontal adiciona mais servidores.",
        "rep": true
      },
      {
        "alternative": "Processo de reduzir número de servidores para economizar custos operacionais.",
        "because": "Incorreto: Isso é apenas parte da elasticidade. A resposta correta é 'Capacidade de adicionar recursos para lidar com aumento de carga'.",
        "rep": false
      },
      {
        "alternative": "Garantir que aplicação nunca sofra interrupção ou tempo de inatividade.",
        "because": "Incorreto: Isso descreve alta disponibilidade. A resposta correta é 'Capacidade de adicionar recursos para lidar com aumento de carga de trabalho'.",
        "rep": false
      },
      {
        "alternative": "Replicar automaticamente dados em múltiplas zonas de disponibilidade diferentes.",
        "because": "Incorreto: Isso descreve redundância de dados. A resposta correta é 'Capacidade de adicionar recursos para lidar com aumento de carga de trabalho'.",
        "rep": false
      }
    ]
  },
  {
    "id": 42,
    "title": "Qual é a diferença entre escalabilidade vertical e horizontal?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Vertical adiciona poder ao servidor; horizontal adiciona mais servidores à infraestrutura.",
        "because": "Correto: Escalabilidade vertical (scale-up) aumenta CPU/RAM de um servidor existente. Horizontal (scale-out) adiciona mais instâncias para distribuir carga entre múltiplos servidores.",
        "rep": true
      },
      {
        "alternative": "Vertical distribui carga; horizontal aumenta capacidade de um único servidor existente.",
        "because": "Incorreto: A definição está invertida. A resposta correta é 'Vertical adiciona poder ao servidor; horizontal adiciona mais servidores à infraestrutura'.",
        "rep": false
      },
      {
        "alternative": "Ambas são termos sinônimos que descrevem exatamente o mesmo conceito técnico.",
        "because": "Incorreto: São conceitos diferentes de escalabilidade. A resposta correta é 'Vertical adiciona poder ao servidor; horizontal adiciona mais servidores à infraestrutura'.",
        "rep": false
      },
      {
        "alternative": "Vertical reduz custos; horizontal aumenta performance sem alterar número de recursos.",
        "because": "Incorreto: Ambas podem afetar custos e performance. A resposta correta é 'Vertical adiciona poder ao servidor; horizontal adiciona mais servidores à infraestrutura'.",
        "rep": false
      }
    ]
  },
  {
    "id": 43,
    "title": "O que caracteriza um modelo de nuvem híbrida?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Uso exclusivo de serviços AWS sem integração com outros provedores de nuvem.",
        "because": "Incorreto: Isso seria nuvem pública única. A resposta correta é 'Combinação de infraestrutura on-premises com serviços de nuvem pública'.",
        "rep": false
      },
      {
        "alternative": "Combinação de infraestrutura on-premises com serviços de nuvem pública integrados.",
        "because": "Correto: Nuvem híbrida conecta infraestrutura local (datacenter próprio) com nuvem pública, permitindo compartilhar dados e aplicações entre ambos ambientes de forma integrada.",
        "rep": true
      },
      {
        "alternative": "Armazenamento de dados apenas em servidores físicos locais sem uso de nuvem.",
        "because": "Incorreto: Isso seria infraestrutura totalmente on-premises. A resposta correta é 'Combinação de infraestrutura on-premises com serviços de nuvem pública'.",
        "rep": false
      },
      {
        "alternative": "Utilização de múltiplos provedores de nuvem pública sem ambiente on-premises.",
        "because": "Incorreto: Isso seria multi-cloud. A resposta correta é 'Combinação de infraestrutura on-premises com serviços de nuvem pública integrados'.",
        "rep": false
      }
    ]
  },
  {
    "id": 44,
    "title": "Qual é o principal benefício de usar múltiplas Availability Zones?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Reduzir custos consolidando todos recursos em um único datacenter isolado.",
        "because": "Incorreto: Usar múltiplas AZs pode aumentar custos. A resposta correta é 'Aumentar disponibilidade e tolerância a falhas da aplicação'.",
        "rep": false
      },
      {
        "alternative": "Aumentar disponibilidade e tolerância a falhas da aplicação distribuindo recursos.",
        "because": "Correto: Distribuir recursos em múltiplas AZs protege contra falha de datacenter. Se uma AZ falhar, a aplicação continua funcionando nas outras AZs disponíveis.",
        "rep": true
      },
      {
        "alternative": "Garantir que todos dados sejam automaticamente replicados em todas regiões globais.",
        "because": "Incorreto: AZs estão dentro de uma região. A resposta correta é 'Aumentar disponibilidade e tolerância a falhas da aplicação distribuindo recursos'.",
        "rep": false
      },
      {
        "alternative": "Eliminar completamente necessidade de implementar estratégias de backup de dados.",
        "because": "Incorreto: Múltiplas AZs não substituem backups. A resposta correta é 'Aumentar disponibilidade e tolerância a falhas da aplicação distribuindo recursos'.",
        "rep": false
      }
    ]
  },
  {
    "id": 45,
    "title": "O que é um modelo de nuvem pública?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Infraestrutura disponível para uso geral via internet fornecida por provedor terceiro.",
        "because": "Correto: Nuvem pública (como AWS, Azure, GCP) é infraestrutura compartilhada de propriedade e operação de provedor terceiro, acessível via internet por múltiplos clientes (multi-tenant).",
        "rep": true
      },
      {
        "alternative": "Datacenter privado exclusivo operado internamente apenas para uma única organização.",
        "because": "Incorreto: Isso descreve nuvem privada. A resposta correta é 'Infraestrutura disponível para uso geral via internet fornecida por provedor terceiro'.",
        "rep": false
      },
      {
        "alternative": "Combinação de recursos locais on-premises integrados com serviços de nuvem externa.",
        "because": "Incorreto: Isso descreve nuvem híbrida. A resposta correta é 'Infraestrutura disponível para uso geral via internet fornecida por provedor terceiro'.",
        "rep": false
      },
      {
        "alternative": "Serviços de nuvem acessíveis exclusivamente dentro de rede privada da empresa.",
        "because": "Incorreto: Isso seria nuvem privada ou VPC. A resposta correta é 'Infraestrutura disponível para uso geral via internet fornecida por provedor terceiro'.",
        "rep": false
      }
    ]
  },
  {
    "id": 46,
    "title": "O que significa 'disaster recovery' (recuperação de desastres) na nuvem?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Processo de aumentar capacidade de recursos durante picos de demanda de tráfego.",
        "because": "Incorreto: Isso descreve escalabilidade ou elasticidade. A resposta correta é 'Estratégia para restaurar operações após evento catastrófico ou falha grave'.",
        "rep": false
      },
      {
        "alternative": "Estratégia para restaurar operações e dados após evento catastrófico ou falha grave.",
        "because": "Correto: Disaster recovery envolve planos, processos e ferramentas para recuperar sistemas críticos após desastres (incêndio, terremoto, ataque) minimizando downtime e perda de dados (RTO/RPO).",
        "rep": true
      },
      {
        "alternative": "Técnica de distribuir tráfego uniformemente entre múltiplos servidores em produção.",
        "because": "Incorreto: Isso descreve load balancing. A resposta correta é 'Estratégia para restaurar operações e dados após evento catastrófico ou falha grave'.",
        "rep": false
      },
      {
        "alternative": "Método de criptografar dados sensíveis armazenados em bancos de dados relacionais.",
        "because": "Incorreto: Isso descreve criptografia de dados. A resposta correta é 'Estratégia para restaurar operações e dados após evento catastrófico ou falha grave'.",
        "rep": false
      }
    ]
  },
  {
    "id": 47,
    "title": "Qual é o modelo de serviço PaaS (Platform as a Service)?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Fornece plataforma gerenciada para desenvolvimento sem gerenciar infraestrutura subjacente.",
        "because": "Correto: PaaS fornece plataforma completa (runtime, middleware, OS) onde você desenvolve e implanta aplicações sem gerenciar servidores. Exemplo: AWS Elastic Beanstalk, Heroku.",
        "rep": true
      },
      {
        "alternative": "Fornece aplicações completas prontas para uso final sem necessidade de desenvolvimento.",
        "because": "Incorreto: Isso descreve SaaS. A resposta correta é 'Fornece plataforma gerenciada para desenvolvimento sem gerenciar infraestrutura subjacente'.",
        "rep": false
      },
      {
        "alternative": "Fornece infraestrutura virtualizada onde você gerencia completamente sistema operacional.",
        "because": "Incorreto: Isso descreve IaaS. A resposta correta é 'Fornece plataforma gerenciada para desenvolvimento sem gerenciar infraestrutura subjacente'.",
        "rep": false
      },
      {
        "alternative": "Cliente assume controle total sobre hardware físico e configurações de rede.",
        "because": "Incorreto: Isso seria infraestrutura on-premises. A resposta correta é 'Fornece plataforma gerenciada para desenvolvimento sem gerenciar infraestrutura subjacente'.",
        "rep": false
      }
    ]
  },
  {
    "id": 48,
    "title": "O que é latência de rede na computação em nuvem?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Custo total mensal de transferência de dados entre diferentes regiões geográficas.",
        "because": "Incorreto: Isso se refere a custos de transferência. A resposta correta é 'Tempo que dados levam para viajar entre origem e destino'.",
        "rep": false
      },
      {
        "alternative": "Tempo que dados levam para viajar entre origem e destino na rede.",
        "because": "Correto: Latência é o atraso (medido em milissegundos) entre envio de requisição e recebimento de resposta. Menor latência = melhor performance. Proximidade geográfica reduz latência.",
        "rep": true
      },
      {
        "alternative": "Quantidade total de dados que podem ser transmitidos por segundo na rede.",
        "because": "Incorreto: Isso descreve largura de banda ou throughput. A resposta correta é 'Tempo que dados levam para viajar entre origem e destino na rede'.",
        "rep": false
      },
      {
        "alternative": "Número máximo de conexões simultâneas que servidor pode aceitar e processar.",
        "because": "Incorreto: Isso se refere a capacidade de conexões. A resposta correta é 'Tempo que dados levam para viajar entre origem e destino na rede'.",
        "rep": false
      }
    ]
  },
  {
    "id": 49,
    "title": "O que caracteriza o modelo SaaS (Software as a Service)?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Aplicações completas acessadas via internet sem necessidade de instalação ou gerenciamento.",
        "because": "Correto: SaaS fornece software pronto para uso via navegador ou API. Provedor gerencia tudo (infraestrutura, plataforma, aplicação). Exemplos: Gmail, Salesforce, Office 365.",
        "rep": true
      },
      {
        "alternative": "Infraestrutura virtualizada onde cliente instala e gerencia próprio sistema operacional.",
        "because": "Incorreto: Isso descreve IaaS. A resposta correta é 'Aplicações completas acessadas via internet sem necessidade de instalação ou gerenciamento'.",
        "rep": false
      },
      {
        "alternative": "Plataforma de desenvolvimento gerenciada onde você cria aplicações customizadas.",
        "because": "Incorreto: Isso descreve PaaS. A resposta correta é 'Aplicações completas acessadas via internet sem necessidade de instalação ou gerenciamento'.",
        "rep": false
      },
      {
        "alternative": "Serviços de armazenamento de objetos acessíveis via API para backup de dados.",
        "because": "Incorreto: Isso descreve object storage. A resposta correta é 'Aplicações completas acessadas via internet sem necessidade de instalação ou gerenciamento'.",
        "rep": false
      }
    ]
  },
  {
    "id": 50,
    "title": "Por que usar várias Regiões AWS pode ser vantajoso?",
    "group_by_topic": "Conceitos de Nuvem",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Reduzir latência para usuários e atender requisitos de residência de dados locais.",
        "because": "Correto: Múltiplas regiões permitem servir usuários de localização mais próxima (menor latência) e cumprir leis de soberania de dados que exigem armazenamento em país específico.",
        "rep": true
      },
      {
        "alternative": "AWS automaticamente replica todos recursos em todas regiões sem configuração adicional.",
        "because": "Incorreto: Replicação entre regiões deve ser configurada. A resposta correta é 'Reduzir latência para usuários e atender requisitos de residência de dados'.",
        "rep": false
      },
      {
        "alternative": "Garantir que custos sejam sempre menores usando regiões com preços mais baixos.",
        "because": "Incorreto: Múltiplas regiões podem aumentar custos. A resposta correta é 'Reduzir latência para usuários e atender requisitos de residência de dados locais'.",
        "rep": false
      },
      {
        "alternative": "Todos os serviços AWS estão disponíveis igualmente em todas as regiões globais.",
        "because": "Incorreto: Disponibilidade de serviços varia por região. A resposta correta é 'Reduzir latência para usuários e atender requisitos de residência de dados locais'.",
        "rep": false
      }
    ]
  },
  {
    "id": 51,
    "title": "Qual princípio de segurança envolve 'defesa em profundidade'?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Implementar múltiplas camadas de controles de segurança em diferentes níveis da arquitetura.",
        "because": "Correto: Defesa em profundidade usa múltiplas camadas de segurança (firewall, WAF, criptografia, IAM, logs) para que se uma camada falhar, outras ainda protegem os recursos.",
        "rep": true
      },
      {
        "alternative": "Confiar em uma única solução de segurança robusta para proteger toda infraestrutura.",
        "because": "Incorreto: Isso viola o princípio de defesa em profundidade. A resposta correta é 'Implementar múltiplas camadas de controles de segurança'.",
        "rep": false
      },
      {
        "alternative": "Eliminar completamente necessidade de monitoramento e auditoria de logs de segurança.",
        "because": "Incorreto: Monitoramento é parte da defesa em profundidade. A resposta correta é 'Implementar múltiplas camadas de controles de segurança'.",
        "rep": false
      },
      {
        "alternative": "Garantir que todos usuários tenham acesso administrativo completo aos recursos.",
        "because": "Incorreto: Isso viola menor privilégio. A resposta correta é 'Implementar múltiplas camadas de controles de segurança em diferentes níveis'.",
        "rep": false
      }
    ]
  },
  {
    "id": 52,
    "title": "O que são Security Groups na AWS?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Firewalls virtuais que controlam tráfego de entrada e saída de instâncias EC2.",
        "because": "Correto: Security Groups são firewalls stateful que operam no nível de instância, controlando tráfego baseado em regras de allow (não há deny explícito). Todo tráfego é negado por padrão.",
        "rep": true
      },
      {
        "alternative": "Grupos de usuários IAM com permissões idênticas para acessar recursos AWS.",
        "because": "Incorreto: Isso são IAM Groups. A resposta correta é 'Firewalls virtuais que controlam tráfego de entrada e saída de instâncias'.",
        "rep": false
      },
      {
        "alternative": "Políticas de criptografia aplicadas automaticamente a todos dados em repouso e trânsito.",
        "because": "Incorreto: Isso se refere a criptografia. A resposta correta é 'Firewalls virtuais que controlam tráfego de entrada e saída de instâncias EC2'.",
        "rep": false
      },
      {
        "alternative": "Serviço gerenciado para detecção de ameaças e vulnerabilidades em aplicações.",
        "because": "Incorreto: Isso seria GuardDuty ou Inspector. A resposta correta é 'Firewalls virtuais que controlam tráfego de entrada e saída de instâncias EC2'.",
        "rep": false
      }
    ]
  },
  {
    "id": 53,
    "title": "O que é AWS Key Management Service (KMS)?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço gerenciado para criar e controlar chaves de criptografia usadas nos serviços AWS.",
        "because": "Correto: KMS permite criar, gerenciar e controlar chaves criptográficas para proteger dados. Integra com serviços AWS (S3, EBS, RDS) e usa HSMs validados FIPS 140-2.",
        "rep": true
      },
      {
        "alternative": "Ferramenta de monitoramento de métricas e logs de segurança em tempo real.",
        "because": "Incorreto: Isso seria CloudWatch ou Security Hub. A resposta correta é 'Serviço gerenciado para criar e controlar chaves de criptografia'.",
        "rep": false
      },
      {
        "alternative": "Sistema de gerenciamento de identidades e controle de acesso para usuários AWS.",
        "because": "Incorreto: Isso é AWS IAM. A resposta correta é 'Serviço gerenciado para criar e controlar chaves de criptografia usadas nos serviços AWS'.",
        "rep": false
      },
      {
        "alternative": "Banco de dados seguro para armazenar senhas e credenciais de aplicações corporativas.",
        "because": "Incorreto: Isso seria Secrets Manager. A resposta correta é 'Serviço gerenciado para criar e controlar chaves de criptografia usadas nos serviços AWS'.",
        "rep": false
      }
    ]
  },
  {
    "id": 54,
    "title": "Para que serve o AWS Secrets Manager?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Gerenciar, recuperar e rotacionar credenciais de bancos de dados e chaves de API.",
        "because": "Correto: Secrets Manager armazena e rotaciona automaticamente secrets (senhas de DB, API keys, tokens). Elimina necessidade de hardcoding de credenciais em código.",
        "rep": true
      },
      {
        "alternative": "Criar e gerenciar chaves criptográficas para proteção de dados em repouso.",
        "because": "Incorreto: Isso é AWS KMS. A resposta correta é 'Gerenciar, recuperar e rotacionar credenciais de bancos de dados e chaves de API'.",
        "rep": false
      },
      {
        "alternative": "Monitorar atividades suspeitas e detectar ameaças em tempo real na conta AWS.",
        "because": "Incorreto: Isso é GuardDuty. A resposta correta é 'Gerenciar, recuperar e rotacionar credenciais de bancos de dados e chaves de API'.",
        "rep": false
      },
      {
        "alternative": "Auditar configurações de recursos e verificar conformidade com políticas internas.",
        "because": "Incorreto: Isso é AWS Config. A resposta correta é 'Gerenciar, recuperar e rotacionar credenciais de bancos de dados e chaves de API'.",
        "rep": false
      }
    ]
  },
  {
    "id": 55,
    "title": "O que é AWS GuardDuty?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de detecção de ameaças que monitora atividades maliciosas e comportamento anômalo.",
        "because": "Correto: GuardDuty usa machine learning para analisar logs (CloudTrail, VPC Flow, DNS) e detectar ameaças como reconhecimento, comprometimento de instância, exfiltração de dados.",
        "rep": true
      },
      {
        "alternative": "Firewall de aplicação web para bloquear ataques de SQL injection e XSS.",
        "because": "Incorreto: Isso é AWS WAF. A resposta correta é 'Serviço de detecção de ameaças que monitora atividades maliciosas e comportamento anômalo'.",
        "rep": false
      },
      {
        "alternative": "Serviço de gerenciamento centralizado de regras de firewall em múltiplas contas.",
        "because": "Incorreto: Isso seria Firewall Manager. A resposta correta é 'Serviço de detecção de ameaças que monitora atividades maliciosas e comportamento anômalo'.",
        "rep": false
      },
      {
        "alternative": "Ferramenta de avaliação de vulnerabilidades em aplicações e instâncias EC2.",
        "because": "Incorreto: Isso é Amazon Inspector. A resposta correta é 'Serviço de detecção de ameaças que monitora atividades maliciosas e comportamento anômalo'.",
        "rep": false
      }
    ]
  },
  {
    "id": 56,
    "title": "O que significa criptografia 'em trânsito' (in transit)?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Criptografar dados enquanto são transmitidos pela rede entre origem e destino.",
        "because": "Correto: Criptografia em trânsito protege dados durante transmissão usando protocolos como TLS/SSL, IPSec. Previne interceptação e ataques man-in-the-middle durante transferência.",
        "rep": true
      },
      {
        "alternative": "Criptografar dados armazenados permanentemente em discos e volumes de armazenamento.",
        "because": "Incorreto: Isso é criptografia em repouso (at rest). A resposta correta é 'Criptografar dados enquanto são transmitidos pela rede entre origem e destino'.",
        "rep": false
      },
      {
        "alternative": "Processo de aplicar hashing unidirecional a senhas antes de armazenar em banco.",
        "because": "Incorreto: Isso se refere a hashing de senhas. A resposta correta é 'Criptografar dados enquanto são transmitidos pela rede entre origem e destino'.",
        "rep": false
      },
      {
        "alternative": "Técnica de ofuscar código-fonte para dificultar engenharia reversa de aplicações.",
        "because": "Incorreto: Isso se refere a ofuscação de código. A resposta correta é 'Criptografar dados enquanto são transmitidos pela rede entre origem e destino'.",
        "rep": false
      }
    ]
  },
  {
    "id": 57,
    "title": "Para que serve o AWS Certificate Manager (ACM)?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Provisionar, gerenciar e implantar certificados SSL/TLS para uso com serviços AWS.",
        "because": "Correto: ACM facilita criação e gerenciamento de certificados SSL/TLS para HTTPS. Renova automaticamente certificados e integra com ELB, CloudFront, API Gateway sem custo adicional.",
        "rep": true
      },
      {
        "alternative": "Gerenciar credenciais de banco de dados e rotacionar secrets automaticamente.",
        "because": "Incorreto: Isso é Secrets Manager. A resposta correta é 'Provisionar, gerenciar e implantar certificados SSL/TLS para uso com serviços AWS'.",
        "rep": false
      },
      {
        "alternative": "Criar e controlar chaves criptográficas para proteção de dados sensíveis em repouso.",
        "because": "Incorreto: Isso é AWS KMS. A resposta correta é 'Provisionar, gerenciar e implantar certificados SSL/TLS para uso com serviços AWS'.",
        "rep": false
      },
      {
        "alternative": "Auditar conformidade de configurações e rastrear mudanças em recursos AWS.",
        "because": "Incorreto: Isso é AWS Config. A resposta correta é 'Provisionar, gerenciar e implantar certificados SSL/TLS para uso com serviços AWS'.",
        "rep": false
      }
    ]
  },
  {
    "id": 58,
    "title": "O que são IAM Roles?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Identidades que podem ser assumidas por usuários ou serviços para obter permissões temporárias.",
        "because": "Correto: Roles são identidades IAM com políticas de permissão que podem ser assumidas por entidades (usuários, aplicações, serviços AWS) para obter credenciais temporárias sem senha.",
        "rep": true
      },
      {
        "alternative": "Contas de usuário permanentes com senhas fixas para acesso programático à AWS.",
        "because": "Incorreto: Isso descreve IAM Users. A resposta correta é 'Identidades que podem ser assumidas por usuários ou serviços para obter permissões temporárias'.",
        "rep": false
      },
      {
        "alternative": "Políticas JSON que definem permissões específicas anexadas a recursos AWS.",
        "because": "Incorreto: Isso descreve IAM Policies. A resposta correta é 'Identidades que podem ser assumidas por usuários ou serviços para obter permissões temporárias'.",
        "rep": false
      },
      {
        "alternative": "Grupos lógicos de usuários IAM com permissões idênticas para facilitar gerenciamento.",
        "because": "Incorreto: Isso descreve IAM Groups. A resposta correta é 'Identidades que podem ser assumidas por usuários ou serviços para obter permissões temporárias'.",
        "rep": false
      }
    ]
  },
  {
    "id": 59,
    "title": "O que é AWS Inspector?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de avaliação automatizada de vulnerabilidades e desvios de melhores práticas.",
        "because": "Correto: Inspector analisa automaticamente aplicações e instâncias EC2 para identificar vulnerabilidades de segurança, exposições e desvios de compliance, gerando relatórios detalhados.",
        "rep": true
      },
      {
        "alternative": "Sistema de detecção de ameaças usando machine learning para identificar comportamento anômalo.",
        "because": "Incorreto: Isso é GuardDuty. A resposta correta é 'Serviço de avaliação automatizada de vulnerabilidades e desvios de melhores práticas'.",
        "rep": false
      },
      {
        "alternative": "Firewall gerenciado que protege aplicações web contra ataques comuns na camada 7.",
        "because": "Incorreto: Isso é AWS WAF. A resposta correta é 'Serviço de avaliação automatizada de vulnerabilidades e desvios de melhores práticas'.",
        "rep": false
      },
      {
        "alternative": "Serviço para auditar configurações de recursos e verificar conformidade com padrões.",
        "because": "Incorreto: Isso é AWS Config. A resposta correta é 'Serviço de avaliação automatizada de vulnerabilidades e desvios de melhores práticas'.",
        "rep": false
      }
    ]
  },
  {
    "id": 60,
    "title": "Qual é a função do AWS Organizations?",
    "group_by_topic": "Conformidade & Segurança",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Gerenciar centralmente múltiplas contas AWS e aplicar políticas em toda organização.",
        "because": "Correto: Organizations permite consolidar múltiplas contas AWS, aplicar SCPs (Service Control Policies) para governança centralizada e consolidar billing para descontos por volume.",
        "rep": true
      },
      {
        "alternative": "Criar e gerenciar usuários individuais e suas permissões de acesso aos recursos.",
        "because": "Incorreto: Isso é AWS IAM. A resposta correta é 'Gerenciar centralmente múltiplas contas AWS e aplicar políticas em toda organização'.",
        "rep": false
      },
      {
        "alternative": "Monitorar custos e criar orçamentos para controlar gastos em serviços AWS.",
        "because": "Incorreto: Isso é AWS Budgets. A resposta correta é 'Gerenciar centralmente múltiplas contas AWS e aplicar políticas em toda organização'.",
        "rep": false
      },
      {
        "alternative": "Auditar logs de atividades e rastrear chamadas de API realizadas na conta.",
        "because": "Incorreto: Isso é CloudTrail. A resposta correta é 'Gerenciar centralmente múltiplas contas AWS e aplicar políticas em toda organização'.",
        "rep": false
      }
    ]
  },
  {
    "id": 61,
    "title": "O que é Amazon Route 53?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de DNS escalável e altamente disponível para rotear usuários para aplicações.",
        "because": "Correto: Route 53 é serviço de DNS gerenciado que traduz nomes de domínio em IPs. Oferece roteamento baseado em latência, geolocalização, failover e health checks.",
        "rep": true
      },
      {
        "alternative": "Rede de distribuição de conteúdo global para entregar arquivos com baixa latência.",
        "because": "Incorreto: Isso é CloudFront. A resposta correta é 'Serviço de DNS escalável e altamente disponível para rotear usuários para aplicações'.",
        "rep": false
      },
      {
        "alternative": "Serviço de load balancing que distribui tráfego entre múltiplas instâncias EC2.",
        "because": "Incorreto: Isso é Elastic Load Balancing. A resposta correta é 'Serviço de DNS escalável e altamente disponível para rotear usuários'.",
        "rep": false
      },
      {
        "alternative": "Firewall virtual que controla tráfego de entrada e saída de recursos AWS.",
        "because": "Incorreto: Isso são Security Groups. A resposta correta é 'Serviço de DNS escalável e altamente disponível para rotear usuários para aplicações'.",
        "rep": false
      }
    ]
  },
  {
    "id": 62,
    "title": "Para que serve o Amazon ElastiCache?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de cache em memória gerenciado compatível com Redis e Memcached.",
        "because": "Correto: ElastiCache fornece armazenamento de dados em memória de alta performance para reduzir latência e carga em bancos de dados, melhorando performance de aplicações web.",
        "rep": true
      },
      {
        "alternative": "Banco de dados NoSQL totalmente gerenciado com performance consistente de milissegundos.",
        "because": "Incorreto: Isso é DynamoDB. A resposta correta é 'Serviço de cache em memória gerenciado compatível com Redis e Memcached'.",
        "rep": false
      },
      {
        "alternative": "Data warehouse otimizado para análise de petabytes de dados estruturados.",
        "because": "Incorreto: Isso é Redshift. A resposta correta é 'Serviço de cache em memória gerenciado compatível com Redis e Memcached'.",
        "rep": false
      },
      {
        "alternative": "Banco de dados relacional gerenciado com suporte a múltiplos engines SQL.",
        "because": "Incorreto: Isso é Amazon RDS. A resposta correta é 'Serviço de cache em memória gerenciado compatível com Redis e Memcached'.",
        "rep": false
      }
    ]
  },
  {
    "id": 63,
    "title": "O que é Amazon Redshift?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Data warehouse rápido, totalmente gerenciado para análise de petabytes de dados.",
        "because": "Correto: Redshift é data warehouse colunar otimizado para analytics e queries complexas em grandes volumes de dados. Usa SQL padrão e integra com ferramentas de BI.",
        "rep": true
      },
      {
        "alternative": "Banco de dados NoSQL serverless com escalabilidade automática para aplicações web.",
        "because": "Incorreto: Isso é DynamoDB. A resposta correta é 'Data warehouse rápido, totalmente gerenciado para análise de petabytes de dados'.",
        "rep": false
      },
      {
        "alternative": "Serviço de cache em memória para melhorar performance de bancos relacionais.",
        "because": "Incorreto: Isso é ElastiCache. A resposta correta é 'Data warehouse rápido, totalmente gerenciado para análise de petabytes de dados'.",
        "rep": false
      },
      {
        "alternative": "Banco de dados relacional gerenciado com backups automáticos e alta disponibilidade.",
        "because": "Incorreto: Isso é Amazon RDS. A resposta correta é 'Data warehouse rápido, totalmente gerenciado para análise de petabytes de dados'.",
        "rep": false
      }
    ]
  },
  {
    "id": 64,
    "title": "Para que serve o Amazon SNS (Simple Notification Service)?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de mensageria pub/sub para enviar notificações a múltiplos assinantes.",
        "because": "Correto: SNS permite publicar mensagens para múltiplos destinos simultaneamente (email, SMS, Lambda, SQS, HTTP endpoints) usando modelo publisher-subscriber (pub/sub).",
        "rep": true
      },
      {
        "alternative": "Fila de mensagens gerenciada para desacoplar componentes de aplicações distribuídas.",
        "because": "Incorreto: Isso é Amazon SQS. A resposta correta é 'Serviço de mensageria pub/sub para enviar notificações a múltiplos assinantes'.",
        "rep": false
      },
      {
        "alternative": "Serviço de e-mail transacional e marketing para envio em larga escala.",
        "because": "Incorreto: Isso é Amazon SES. A resposta correta é 'Serviço de mensageria pub/sub para enviar notificações a múltiplos assinantes'.",
        "rep": false
      },
      {
        "alternative": "Sistema de notificações para alertas de custos e limites de orçamento AWS.",
        "because": "Incorreto: Isso é parte do Budgets. A resposta correta é 'Serviço de mensageria pub/sub para enviar notificações a múltiplos assinantes'.",
        "rep": false
      }
    ]
  },
  {
    "id": 65,
    "title": "O que é Amazon SQS (Simple Queue Service)?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Fila de mensagens gerenciada para desacoplar e escalar microserviços distribuídos.",
        "because": "Correto: SQS é serviço de fila totalmente gerenciado que permite desacoplar componentes, processar mensagens assincronamente e escalar independentemente produtores e consumidores.",
        "rep": true
      },
      {
        "alternative": "Serviço pub/sub para enviar notificações simultâneas a múltiplos endpoints diferentes.",
        "because": "Incorreto: Isso é Amazon SNS. A resposta correta é 'Fila de mensagens gerenciada para desacoplar e escalar microserviços distribuídos'.",
        "rep": false
      },
      {
        "alternative": "Banco de dados de documentos NoSQL para armazenar dados semi-estruturados.",
        "because": "Incorreto: Isso é DynamoDB. A resposta correta é 'Fila de mensagens gerenciada para desacoplar e escalar microserviços distribuídos'.",
        "rep": false
      },
      {
        "alternative": "Serviço de streaming de dados em tempo real para ingestão de eventos.",
        "because": "Incorreto: Isso é Kinesis. A resposta correta é 'Fila de mensagens gerenciada para desacoplar e escalar microserviços distribuídos'.",
        "rep": false
      }
    ]
  },
  {
    "id": 66,
    "title": "Para que serve o AWS Elastic Beanstalk?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Implantar e escalar aplicações web sem gerenciar infraestrutura subjacente.",
        "because": "Correto: Elastic Beanstalk é PaaS que automatiza provisionamento de recursos (EC2, load balancer, Auto Scaling) - você faz upload do código e o serviço gerencia tudo.",
        "rep": true
      },
      {
        "alternative": "Orquestrar containers Docker em clusters de instâncias EC2 gerenciadas.",
        "because": "Incorreto: Isso é Amazon ECS. A resposta correta é 'Implantar e escalar aplicações web sem gerenciar infraestrutura subjacente'.",
        "rep": false
      },
      {
        "alternative": "Executar código serverless em resposta a eventos sem provisionar servidores.",
        "because": "Incorreto: Isso é AWS Lambda. A resposta correta é 'Implantar e escalar aplicações web sem gerenciar infraestrutura subjacente'.",
        "rep": false
      },
      {
        "alternative": "Criar e gerenciar pipelines de CI/CD para automação de deploy de aplicações.",
        "because": "Incorreto: Isso é CodePipeline. A resposta correta é 'Implantar e escalar aplicações web sem gerenciar infraestrutura subjacente'.",
        "rep": false
      }
    ]
  },
  {
    "id": 67,
    "title": "O que é Amazon ECS (Elastic Container Service)?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Serviço de orquestração de containers altamente escalável para executar aplicações Docker.",
        "because": "Correto: ECS permite executar, parar e gerenciar containers Docker em cluster. Pode usar EC2 (você gerencia) ou Fargate (serverless) como infraestrutura subjacente.",
        "rep": true
      },
      {
        "alternative": "Plataforma gerenciada para implantar aplicações web sem gerenciar servidores.",
        "because": "Incorreto: Isso é Elastic Beanstalk. A resposta correta é 'Serviço de orquestração de containers altamente escalável para executar aplicações Docker'.",
        "rep": false
      },
      {
        "alternative": "Serviço serverless para executar código em resposta a eventos sem containers.",
        "because": "Incorreto: Isso é AWS Lambda. A resposta correta é 'Serviço de orquestração de containers altamente escalável para executar aplicações Docker'.",
        "rep": false
      },
      {
        "alternative": "Registro privado gerenciado para armazenar e gerenciar imagens de containers Docker.",
        "because": "Incorreto: Isso é Amazon ECR. A resposta correta é 'Serviço de orquestração de containers altamente escalável para executar aplicações Docker'.",
        "rep": false
      }
    ]
  },
  {
    "id": 68,
    "title": "Para que serve o Amazon CloudWatch?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Monitorar recursos AWS, coletar métricas, logs e configurar alarmes operacionais.",
        "because": "Correto: CloudWatch coleta e rastreia métricas, monitora arquivos de log, configura alarmes automatizados e cria dashboards para visualizar saúde e performance de recursos AWS.",
        "rep": true
      },
      {
        "alternative": "Registrar e auditar todas chamadas de API realizadas na conta AWS.",
        "because": "Incorreto: Isso é CloudTrail. A resposta correta é 'Monitorar recursos AWS, coletar métricas, logs e configurar alarmes operacionais'.",
        "rep": false
      },
      {
        "alternative": "Detectar ameaças e comportamento anômalo usando machine learning avançado.",
        "because": "Incorreto: Isso é GuardDuty. A resposta correta é 'Monitorar recursos AWS, coletar métricas, logs e configurar alarmes operacionais'.",
        "rep": false
      },
      {
        "alternative": "Avaliar vulnerabilidades de segurança e conformidade em instâncias EC2.",
        "because": "Incorreto: Isso é Inspector. A resposta correta é 'Monitorar recursos AWS, coletar métricas, logs e configurar alarmes operacionais'.",
        "rep": false
      }
    ]
  },
  {
    "id": 69,
    "title": "O que é Amazon Aurora?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Banco de dados relacional compatível com MySQL e PostgreSQL de alta performance.",
        "because": "Correto: Aurora é banco relacional totalmente gerenciado, compatível com MySQL e PostgreSQL, até 5x mais rápido que MySQL padrão. Oferece alta disponibilidade e replicação automática.",
        "rep": true
      },
      {
        "alternative": "Banco de dados NoSQL serverless com escalabilidade automática para qualquer escala.",
        "because": "Incorreto: Isso é DynamoDB. A resposta correta é 'Banco de dados relacional compatível com MySQL e PostgreSQL de alta performance'.",
        "rep": false
      },
      {
        "alternative": "Data warehouse colunar otimizado para analytics e queries complexas em petabytes.",
        "because": "Incorreto: Isso é Redshift. A resposta correta é 'Banco de dados relacional compatível com MySQL e PostgreSQL de alta performance'.",
        "rep": false
      },
      {
        "alternative": "Serviço de cache em memória para reduzir latência de leitura em bancos.",
        "because": "Incorreto: Isso é ElastiCache. A resposta correta é 'Banco de dados relacional compatível com MySQL e PostgreSQL de alta performance'.",
        "rep": false
      }
    ]
  },
  {
    "id": 70,
    "title": "Para que serve o Amazon API Gateway?",
    "group_by_topic": "Serviços básicos da AWS",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Criar, publicar, manter e monitorar APIs RESTful e WebSocket em qualquer escala.",
        "because": "Correto: API Gateway permite criar APIs que atuam como porta de entrada para aplicações, integrando com Lambda, EC2, outros serviços. Gerencia autorização, throttling, caching.",
        "rep": true
      },
      {
        "alternative": "Distribuir conteúdo estático globalmente através de rede de edge locations.",
        "because": "Incorreto: Isso é CloudFront. A resposta correta é 'Criar, publicar, manter e monitorar APIs RESTful e WebSocket em qualquer escala'.",
        "rep": false
      },
      {
        "alternative": "Executar código serverless em resposta a eventos HTTP sem gerenciar servidores.",
        "because": "Incorreto: Isso é Lambda (pode integrar com API Gateway). A resposta correta é 'Criar, publicar, manter e monitorar APIs RESTful e WebSocket'.",
        "rep": false
      },
      {
        "alternative": "Balancear tráfego de entrada entre múltiplas instâncias EC2 em diferentes AZs.",
        "because": "Incorreto: Isso é ELB. A resposta correta é 'Criar, publicar, manter e monitorar APIs RESTful e WebSocket em qualquer escala'.",
        "rep": false
      }
    ]
  },
  {
    "id": 71,
    "title": "O que é o modelo de precificação de instâncias On-Demand?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Pagar por capacidade de computação por hora ou segundo sem compromissos de longo prazo.",
        "because": "Correto: On-Demand cobra por hora/segundo de uso sem contratos ou pagamentos antecipados. Ideal para workloads imprevisíveis, testes e aplicações de curto prazo.",
        "rep": true
      },
      {
        "alternative": "Compromisso de 1 ou 3 anos que oferece desconto significativo sobre preço padrão.",
        "because": "Incorreto: Isso são Reserved Instances. A resposta correta é 'Pagar por capacidade de computação por hora ou segundo sem compromissos'.",
        "rep": false
      },
      {
        "alternative": "Instâncias com desconto de até 90% que podem ser interrompidas pela AWS.",
        "because": "Incorreto: Isso são Spot Instances. A resposta correta é 'Pagar por capacidade de computação por hora ou segundo sem compromissos de longo prazo'.",
        "rep": false
      },
      {
        "alternative": "Compromisso de gasto por hora com flexibilidade entre tipos de instância e regiões.",
        "because": "Incorreto: Isso são Savings Plans. A resposta correta é 'Pagar por capacidade de computação por hora ou segundo sem compromissos de longo prazo'.",
        "rep": false
      }
    ]
  },
  {
    "id": 72,
    "title": "O que é AWS Billing Dashboard?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Interface que mostra gastos atuais, faturas e previsões de custos mensais.",
        "because": "Correto: Billing Dashboard fornece visão geral de custos AWS, incluindo saldo atual do mês, comparações mensais, faturas anteriores e estimativas de gastos futuros.",
        "rep": true
      },
      {
        "alternative": "Ferramenta avançada para criar relatórios customizados e analisar tendências de custos.",
        "because": "Incorreto: Isso é Cost Explorer. A resposta correta é 'Interface que mostra gastos atuais, faturas e previsões de custos mensais'.",
        "rep": false
      },
      {
        "alternative": "Serviço para definir orçamentos e receber alertas quando limites são excedidos.",
        "because": "Incorreto: Isso é AWS Budgets. A resposta correta é 'Interface que mostra gastos atuais, faturas e previsões de custos mensais'.",
        "rep": false
      },
      {
        "alternative": "Calculadora online para estimar custos de arquiteturas AWS antes de implantação.",
        "because": "Incorreto: Isso é Pricing Calculator. A resposta correta é 'Interface que mostra gastos atuais, faturas e previsões de custos mensais'.",
        "rep": false
      }
    ]
  },
  {
    "id": 73,
    "title": "Para que serve o AWS Pricing Calculator?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Estimar custos de serviços AWS antes de provisioná-los e criar previsões orçamentárias.",
        "because": "Correto: Pricing Calculator permite modelar arquiteturas, estimar custos mensais de serviços AWS, comparar opções de precificação e exportar estimativas para planejamento.",
        "rep": true
      },
      {
        "alternative": "Monitorar custos em tempo real e criar alertas quando gastos excedem limites.",
        "because": "Incorreto: Isso é AWS Budgets. A resposta correta é 'Estimar custos de serviços AWS antes de provisioná-los e criar previsões orçamentárias'.",
        "rep": false
      },
      {
        "alternative": "Visualizar gastos históricos e identificar oportunidades de economia em recursos existentes.",
        "because": "Incorreto: Isso é Cost Explorer. A resposta correta é 'Estimar custos de serviços AWS antes de provisioná-los e criar previsões orçamentárias'.",
        "rep": false
      },
      {
        "alternative": "Consolidar faturas de múltiplas contas AWS para obter descontos por volume.",
        "because": "Incorreto: Isso é Consolidated Billing. A resposta correta é 'Estimar custos de serviços AWS antes de provisioná-los e criar previsões orçamentárias'.",
        "rep": false
      }
    ]
  },
  {
    "id": 74,
    "title": "O que é Consolidated Billing no AWS Organizations?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Combinar uso de múltiplas contas em fatura única para obter descontos por volume.",
        "because": "Correto: Consolidated Billing consolida pagamento de todas contas vinculadas em uma fatura, permitindo compartilhar descontos de volume, RIs e Savings Plans entre contas.",
        "rep": true
      },
      {
        "alternative": "Distribuir custos automaticamente entre departamentos usando tags de alocação.",
        "because": "Incorreto: Tags ajudam mas não é função principal. A resposta correta é 'Combinar uso de múltiplas contas em fatura única para obter descontos por volume'.",
        "rep": false
      },
      {
        "alternative": "Criar orçamentos separados para cada conta AWS e receber alertas individualizados.",
        "because": "Incorreto: Isso seria uso de Budgets. A resposta correta é 'Combinar uso de múltiplas contas em fatura única para obter descontos por volume'.",
        "rep": false
      },
      {
        "alternative": "Aplicar políticas de controle de serviços em todas contas da organização centralizadamente.",
        "because": "Incorreto: Isso são SCPs do Organizations. A resposta correta é 'Combinar uso de múltiplas contas em fatura única para obter descontos por volume'.",
        "rep": false
      }
    ]
  },
  {
    "id": 75,
    "title": "Quais fatores afetam o custo de transferência de dados na AWS?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Quantidade de dados transferidos, direção do tráfego e regiões envolvidas na transferência.",
        "because": "Correto: Dados transferidos para fora da AWS são cobrados. Transferência entre regiões tem custo. Dados recebidos (inbound) geralmente são gratuitos. Transferência dentro da mesma AZ é gratuita.",
        "rep": true
      },
      {
        "alternative": "Apenas o tipo de instância EC2 utilizada determina custos de transferência.",
        "because": "Incorreto: Tipo de instância não afeta transferência. A resposta correta é 'Quantidade de dados, direção do tráfego e regiões envolvidas'.",
        "rep": false
      },
      {
        "alternative": "Transferência de dados sempre é gratuita independente de volume ou destino.",
        "because": "Incorreto: Há custos de transferência em muitos cenários. A resposta correta é 'Quantidade de dados, direção do tráfego e regiões envolvidas'.",
        "rep": false
      },
      {
        "alternative": "Custos dependem exclusivamente do plano de suporte AWS contratado pela organização.",
        "because": "Incorreto: Suporte não afeta custos de transferência. A resposta correta é 'Quantidade de dados, direção do tráfego e regiões envolvidas'.",
        "rep": false
      }
    ]
  },
  {
    "id": 76,
    "title": "O que é o AWS Partner Network (APN)?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Programa global de parceiros que oferece soluções e serviços baseados em AWS.",
        "because": "Correto: APN conecta clientes a consultores e provedores de tecnologia especializados em AWS. Inclui parceiros de consultoria e tecnologia certificados pela AWS.",
        "rep": true
      },
      {
        "alternative": "Rede privada virtual para conectar datacenters on-premises com infraestrutura AWS.",
        "because": "Incorreto: Isso seria VPN ou Direct Connect. A resposta correta é 'Programa global de parceiros que oferece soluções e serviços baseados em AWS'.",
        "rep": false
      },
      {
        "alternative": "Ferramenta de gerenciamento de múltiplas contas AWS em uma organização centralizada.",
        "because": "Incorreto: Isso é AWS Organizations. A resposta correta é 'Programa global de parceiros que oferece soluções e serviços baseados em AWS'.",
        "rep": false
      },
      {
        "alternative": "Serviço de suporte técnico premium com tempo de resposta garantido em 15 minutos.",
        "because": "Incorreto: Isso é Enterprise Support. A resposta correta é 'Programa global de parceiros que oferece soluções e serviços baseados em AWS'.",
        "rep": false
      }
    ]
  },
  {
    "id": 77,
    "title": "Qual é a diferença entre Standard e Convertible Reserved Instances?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Standard oferece maior desconto; Convertible permite trocar tipo de instância durante termo.",
        "because": "Correto: Standard RIs oferecem até 75% de desconto mas são fixas. Convertible RIs oferecem até 66% de desconto mas permitem trocar família de instância, SO e tenancy.",
        "rep": true
      },
      {
        "alternative": "Convertible é mais barata; Standard oferece flexibilidade de mudar atributos da instância.",
        "because": "Incorreto: A relação está invertida. A resposta correta é 'Standard oferece maior desconto; Convertible permite trocar tipo de instância durante termo'.",
        "rep": false
      },
      {
        "alternative": "Ambas são idênticas em desconto e flexibilidade, diferindo apenas no nome comercial.",
        "because": "Incorreto: Há diferenças significativas. A resposta correta é 'Standard oferece maior desconto; Convertible permite trocar tipo de instância durante termo'.",
        "rep": false
      },
      {
        "alternative": "Standard pode ser revendida no marketplace; Convertible nunca pode ser transferida ou vendida.",
        "because": "Incorreto: Ambas podem ser vendidas no RI Marketplace. A resposta correta é 'Standard oferece maior desconto; Convertible permite trocar tipo de instância'.",
        "rep": false
      }
    ]
  },
  {
    "id": 78,
    "title": "Para que serve o AWS Support Concierge?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Especialistas em billing e contas disponíveis exclusivamente para clientes Enterprise Support.",
        "because": "Correto: Support Concierge auxilia clientes Enterprise com questões de billing, análise de custos, otimização de gastos e configuração de contas. Disponível apenas no plano Enterprise.",
        "rep": true
      },
      {
        "alternative": "Ferramenta automatizada que fornece recomendações de otimização de custos e performance.",
        "because": "Incorreto: Isso é Trusted Advisor. A resposta correta é 'Especialistas em billing e contas disponíveis exclusivamente para clientes Enterprise Support'.",
        "rep": false
      },
      {
        "alternative": "Serviço de gerenciamento de incidentes críticos disponível em todos planos de suporte.",
        "because": "Incorreto: Concierge é exclusivo Enterprise. A resposta correta é 'Especialistas em billing e contas disponíveis exclusivamente para clientes Enterprise Support'.",
        "rep": false
      },
      {
        "alternative": "Sistema de criação e rastreamento de tickets de suporte técnico via console AWS.",
        "because": "Incorreto: Isso é Support Center. A resposta correta é 'Especialistas em billing e contas disponíveis exclusivamente para clientes Enterprise Support'.",
        "rep": false
      }
    ]
  },
  {
    "id": 79,
    "title": "O que é AWS Marketplace?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 1,
    "response": [
      {
        "alternative": "Catálogo digital com milhares de soluções de software de terceiros para executar na AWS.",
        "because": "Correto: AWS Marketplace permite descobrir, comprar e implantar software de terceiros (AMIs, SaaS, containers). Billing consolidado na fatura AWS.",
        "rep": true
      },
      {
        "alternative": "Plataforma de negociação de Reserved Instances entre diferentes contas AWS corporativas.",
        "because": "Incorreto: Isso é Reserved Instance Marketplace. A resposta correta é 'Catálogo digital com milhares de soluções de software de terceiros'.",
        "rep": false
      },
      {
        "alternative": "Serviço de consultoria especializada para arquitetar soluções empresariais complexas.",
        "because": "Incorreto: Isso seria Professional Services. A resposta correta é 'Catálogo digital com milhares de soluções de software de terceiros para executar na AWS'.",
        "rep": false
      },
      {
        "alternative": "Sistema de leilão para adquirir capacidade de computação EC2 com grandes descontos.",
        "because": "Incorreto: Isso se refere a Spot Instances. A resposta correta é 'Catálogo digital com milhares de soluções de software de terceiros'.",
        "rep": false
      }
    ]
  },
  {
    "id": 80,
    "title": "Qual é o benefício do AWS Compute Savings Plans?",
    "group_by_topic": "Cobrança e Suporte",
    "accept_two_alternatives": false,
    "level_of_complexity": 2,
    "response": [
      {
        "alternative": "Desconto em compute (EC2, Lambda, Fargate) com flexibilidade entre tipos e regiões.",
        "because": "Correto: Compute Savings Plans oferecem até 66% de desconto aplicável a qualquer família de instância EC2, região, SO, tenancy e também Lambda e Fargate.",
        "rep": true
      },
      {
        "alternative": "Desconto aplicável apenas a instâncias EC2 de família e região específicas escolhidas.",
        "because": "Incorreto: Isso seria EC2 Instance Savings Plan. A resposta correta é 'Desconto em compute (EC2, Lambda, Fargate) com flexibilidade entre tipos e regiões'.",
        "rep": false
      },
      {
        "alternative": "Programa exclusivo para clientes Enterprise com desconto fixo de 90% em todos serviços.",
        "because": "Incorreto: Desconto não é fixo em 90%. A resposta correta é 'Desconto em compute (EC2, Lambda, Fargate) com flexibilidade entre tipos e regiões'.",
        "rep": false
      },
      {
        "alternative": "Compromisso de uso mínimo mensal sem desconto mas com garantia de capacidade reservada.",
        "because": "Incorreto: Savings Plans oferecem desconto. A resposta correta é 'Desconto em compute (EC2, Lambda, Fargate) com flexibilidade entre tipos e regiões'.",
        "rep": false
      }
    ]
  }
]
